{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_14", 0, 0]], "name": "model_6", "input_layers": [["input_6", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_6", "class_name": "InputLayer", "config": {"name": "input_6", "batch_input_shape": [null, 76, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_2", "kernel_size": [3], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "conv1d_3", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_3", "kernel_size": [5], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "max_pooling1d_1", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "name": "max_pooling1d_2", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling1d_1", 0, 0, {}], ["max_pooling1d_2", 0, 0, {}]]], "name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "flatten_6", "class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_6", 0, 0, {}]]], "name": "dense_13", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_13", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 64, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_13", 0, 0, {}]]], "name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "dense_14", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_14", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}