{"config": {"output_layers": [["dense_254", 0, 0]], "input_layers": [["input_110", 0, 0]], "name": "model_110", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 76, 1], "name": "input_110", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_110", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_162", "use_bias": true, "data_format": "channels_last", "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_162", "inbound_nodes": [[["input_110", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_163", "use_bias": true, "data_format": "channels_last", "kernel_size": [5], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_163", "inbound_nodes": [[["input_110", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_33", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_33", "inbound_nodes": [[["conv1d_162", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_34", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_34", "inbound_nodes": [[["conv1d_163", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_84"}, "class_name": "Concatenate", "name": "concatenate_84", "inbound_nodes": [[["max_pooling1d_33", 0, 0, {}], ["max_pooling1d_34", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_110"}, "class_name": "Flatten", "name": "flatten_110", "inbound_nodes": [[["concatenate_84", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_253", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_253", "inbound_nodes": [[["flatten_110", 0, 0, {}]]]}, {"config": {"name": "dropout_136", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_136", "inbound_nodes": [[["dense_253", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_254", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_254", "inbound_nodes": [[["dropout_136", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}