{"config": {"input_layers": [["input_20", 0, 0]], "output_layers": [["dense_80", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 76, 1], "dtype": "float32", "sparse": false, "name": "input_20"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_20"}, {"config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "flatten_20"}, "class_name": "Flatten", "inbound_nodes": [[["input_20", 0, 0, {}]]], "name": "flatten_20"}, {"config": {"use_bias": true, "activation": "relu", "dtype": "float32", "units": 64, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_77", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "name": "dense_77"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_58", "dtype": "float32", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_77", 0, 0, {}]]], "name": "dropout_58"}, {"config": {"use_bias": true, "activation": "relu", "dtype": "float32", "units": 64, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_78", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_58", 0, 0, {}]]], "name": "dense_78"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_59", "dtype": "float32", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_78", 0, 0, {}]]], "name": "dropout_59"}, {"config": {"use_bias": true, "activation": "relu", "dtype": "float32", "units": 64, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_79", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_59", 0, 0, {}]]], "name": "dense_79"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_60", "dtype": "float32", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_79", 0, 0, {}]]], "name": "dropout_60"}, {"config": {"use_bias": true, "activation": "sigmoid", "dtype": "float32", "units": 1, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_80", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_60", 0, 0, {}]]], "name": "dense_80"}], "name": "model_20"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}