{"config": {"input_layers": [["input_10", 0, 0]], "output_layers": [["dense_40", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 76, 1], "dtype": "float32", "sparse": false, "name": "input_10"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_10"}, {"config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "flatten_10"}, "class_name": "Flatten", "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "flatten_10"}, {"config": {"use_bias": true, "activation": "relu", "dtype": "float32", "units": 64, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_37", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "name": "dense_37"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_28", "dtype": "float32", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_37", 0, 0, {}]]], "name": "dropout_28"}, {"config": {"use_bias": true, "activation": "relu", "dtype": "float32", "units": 64, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_38", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_28", 0, 0, {}]]], "name": "dense_38"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_29", "dtype": "float32", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_38", 0, 0, {}]]], "name": "dropout_29"}, {"config": {"use_bias": true, "activation": "relu", "dtype": "float32", "units": 64, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_39", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_29", 0, 0, {}]]], "name": "dense_39"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_30", "dtype": "float32", "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense_39", 0, 0, {}]]], "name": "dropout_30"}, {"config": {"use_bias": true, "activation": "sigmoid", "dtype": "float32", "units": 1, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_40", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_30", 0, 0, {}]]], "name": "dense_40"}], "name": "model_10"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}