{"config": {"output_layers": [["dense_554", 0, 0]], "input_layers": [["input_240", 0, 0]], "name": "model_240", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 76, 1], "name": "input_240", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_240", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_362", "use_bias": true, "data_format": "channels_last", "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_362", "inbound_nodes": [[["input_240", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_363", "use_bias": true, "data_format": "channels_last", "kernel_size": [5], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_363", "inbound_nodes": [[["input_240", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_73", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_73", "inbound_nodes": [[["conv1d_362", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_74", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_74", "inbound_nodes": [[["conv1d_363", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_184"}, "class_name": "Concatenate", "name": "concatenate_184", "inbound_nodes": [[["max_pooling1d_73", 0, 0, {}], ["max_pooling1d_74", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_240"}, "class_name": "Flatten", "name": "flatten_240", "inbound_nodes": [[["concatenate_184", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_553", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_553", "inbound_nodes": [[["flatten_240", 0, 0, {}]]]}, {"config": {"name": "dropout_296", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_296", "inbound_nodes": [[["dense_553", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_554", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_554", "inbound_nodes": [[["dropout_296", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}