{"class_name": "Model", "keras_version": "2.2.5", "config": {"output_layers": [["dense_230", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_105", "config": {"sparse": false, "batch_input_shape": [null, 76, 1], "dtype": "float32", "name": "input_105"}}, {"inbound_nodes": [[["input_105", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_155", "config": {"name": "conv1d_155", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [3], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["input_105", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_156", "config": {"name": "conv1d_156", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [5], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_155", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_37", "config": {"pool_size": [3], "name": "max_pooling1d_37", "dtype": "float32", "data_format": "channels_last", "trainable": true, "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["conv1d_156", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_38", "config": {"pool_size": [3], "name": "max_pooling1d_38", "dtype": "float32", "data_format": "channels_last", "trainable": true, "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling1d_37", 0, 0, {}], ["max_pooling1d_38", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_85", "config": {"trainable": true, "axis": 1, "name": "concatenate_85", "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_85", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_105", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_105", "dtype": "float32"}}, {"inbound_nodes": [[["flatten_105", 0, 0, {}]]], "class_name": "Dense", "name": "dense_229", "config": {"name": "dense_229", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_229", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_125", "config": {"name": "dropout_125", "dtype": "float32", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"inbound_nodes": [[["dropout_125", 0, 0, {}]]], "class_name": "Dense", "name": "dense_230", "config": {"name": "dense_230", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_105", "input_layers": [["input_105", 0, 0]]}, "backend": "tensorflow"}