{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_16", 0, 0]], "name": "model_7", "input_layers": [["input_7", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_7", "class_name": "InputLayer", "config": {"name": "input_7", "batch_input_shape": [null, 1406, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "conv1d_4", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_4", "kernel_size": [3], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "conv1d_5", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_5", "kernel_size": [5], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "name": "max_pooling1d_3", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "name": "max_pooling1d_4", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling1d_3", 0, 0, {}], ["max_pooling1d_4", 0, 0, {}]]], "name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "flatten_7", "class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_7", 0, 0, {}]]], "name": "dense_15", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_15", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 64, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_15", 0, 0, {}]]], "name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "dense_16", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_16", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}