{"class_name": "Model", "keras_version": "2.2.5", "config": {"output_layers": [["dense_232", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_106", "config": {"sparse": false, "batch_input_shape": [null, 1406, 1], "dtype": "float32", "name": "input_106"}}, {"inbound_nodes": [[["input_106", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_157", "config": {"name": "conv1d_157", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [3], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["input_106", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_158", "config": {"name": "conv1d_158", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [5], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_157", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_39", "config": {"pool_size": [3], "name": "max_pooling1d_39", "dtype": "float32", "data_format": "channels_last", "trainable": true, "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["conv1d_158", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_40", "config": {"pool_size": [3], "name": "max_pooling1d_40", "dtype": "float32", "data_format": "channels_last", "trainable": true, "strides": [3], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling1d_39", 0, 0, {}], ["max_pooling1d_40", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_86", "config": {"trainable": true, "axis": 1, "name": "concatenate_86", "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_86", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_106", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_106", "dtype": "float32"}}, {"inbound_nodes": [[["flatten_106", 0, 0, {}]]], "class_name": "Dense", "name": "dense_231", "config": {"name": "dense_231", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_231", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_126", "config": {"name": "dropout_126", "dtype": "float32", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"inbound_nodes": [[["dropout_126", 0, 0, {}]]], "class_name": "Dense", "name": "dense_232", "config": {"name": "dense_232", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_106", "input_layers": [["input_106", 0, 0]]}, "backend": "tensorflow"}