{"class_name": "Model", "config": {"name": "model_10", "input_layers": [["input_10", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1406, 1], "name": "input_10", "dtype": "float32", "sparse": false}, "name": "input_10", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_19", "dtype": "float32", "padding": "valid", "bias_regularizer": null, "kernel_size": [3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "strides": [1], "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null}, "name": "conv1d_19", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_20", "dtype": "float32", "padding": "valid", "bias_regularizer": null, "kernel_size": [5], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "strides": [1], "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null}, "name": "conv1d_20", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_19", "dtype": "float32", "padding": "valid", "strides": [3], "data_format": "channels_last", "pool_size": [3], "trainable": true}, "name": "max_pooling1d_19", "inbound_nodes": [[["conv1d_19", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_20", "dtype": "float32", "padding": "valid", "strides": [3], "data_format": "channels_last", "pool_size": [3], "trainable": true}, "name": "max_pooling1d_20", "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_10", "dtype": "float32", "trainable": true, "axis": 1}, "name": "concatenate_10", "inbound_nodes": [[["max_pooling1d_19", 0, 0, {}], ["max_pooling1d_20", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_10", "dtype": "float32", "trainable": true}, "name": "flatten_10", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "dtype": "float32", "units": 64, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "name": "dense_19", "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_10", "dtype": "float32", "rate": 0.5, "trainable": true, "noise_shape": null}, "name": "dropout_10", "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "dtype": "float32", "units": 1, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "name": "dense_20", "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}], "output_layers": [["dense_20", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}