{"class_name": "Model", "keras_version": "2.2.5", "config": {"name": "model_105", "layers": [{"name": "input_96", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_96", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1406, 1]}}, {"name": "conv1d_147", "class_name": "Conv1D", "inbound_nodes": [[["input_96", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_147", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv1d_148", "class_name": "Conv1D", "inbound_nodes": [[["input_96", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_148", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "max_pooling1d_39", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_147", 0, 0, {}]]], "config": {"name": "max_pooling1d_39", "pool_size": [3], "dtype": "float32", "trainable": true, "strides": [3], "data_format": "channels_last", "padding": "valid"}}, {"name": "max_pooling1d_40", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_148", 0, 0, {}]]], "config": {"name": "max_pooling1d_40", "pool_size": [3], "dtype": "float32", "trainable": true, "strides": [3], "data_format": "channels_last", "padding": "valid"}}, {"name": "concatenate_95", "class_name": "Concatenate", "inbound_nodes": [[["max_pooling1d_39", 0, 0, {}], ["max_pooling1d_40", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_95", "dtype": "float32", "trainable": true}}, {"name": "flatten_96", "class_name": "Flatten", "inbound_nodes": [[["concatenate_95", 0, 0, {}]]], "config": {"name": "flatten_96", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_229", "class_name": "Dense", "inbound_nodes": [[["flatten_96", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_229", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dropout_116", "class_name": "Dropout", "inbound_nodes": [[["dense_229", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_116", "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"name": "dense_230", "class_name": "Dense", "inbound_nodes": [[["dropout_116", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_230", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}], "output_layers": [["dense_230", 0, 0]], "input_layers": [["input_96", 0, 0]]}, "backend": "tensorflow"}