{"class_name": "Model", "keras_version": "2.2.5", "config": {"input_layers": [["input_10", 0, 0]], "output_layers": [["dense_20", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1406, 1], "name": "input_10", "sparse": false, "dtype": "float32"}, "name": "input_10"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"use_bias": true, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "strides": [1], "kernel_size": [3], "kernel_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "name": "conv1d_19", "trainable": true, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "name": "conv1d_19"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"use_bias": true, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "strides": [1], "kernel_size": [5], "kernel_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "name": "conv1d_20", "trainable": true, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "name": "conv1d_20"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_19", 0, 0, {}]]], "config": {"name": "max_pooling1d_19", "trainable": true, "dtype": "float32", "strides": [3], "padding": "valid", "data_format": "channels_last", "pool_size": [3]}, "name": "max_pooling1d_19"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_20", 0, 0, {}]]], "config": {"name": "max_pooling1d_20", "trainable": true, "dtype": "float32", "strides": [3], "padding": "valid", "data_format": "channels_last", "pool_size": [3]}, "name": "max_pooling1d_20"}, {"class_name": "Concatenate", "inbound_nodes": [[["max_pooling1d_19", 0, 0, {}], ["max_pooling1d_20", 0, 0, {}]]], "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_10"}, {"class_name": "Flatten", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_10", "data_format": "channels_last", "dtype": "float32"}, "name": "flatten_10"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "dense_19", "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "name": "dense_19"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_19", 0, 0, {}]]], "config": {"name": "dropout_10", "trainable": true, "dtype": "float32", "noise_shape": null, "seed": null, "rate": 0.5}, "name": "dropout_10"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "name": "dense_20", "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}, "name": "dense_20"}], "name": "model_10"}, "backend": "tensorflow"}