{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_8", 0, 0]], "name": "model_3", "input_layers": [["input_3", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_3", "class_name": "InputLayer", "config": {"name": "input_3", "batch_input_shape": [null, 601, 15, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_7", "kernel_size": [3, 15], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_8", "kernel_size": [4, 15], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "dense_6", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_6", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_6", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dense_7", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_7", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_7", 0, 0, {}]]], "name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "dense_8", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_8", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}