{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_570", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_570", "config": {"dtype": "float32", "sparse": false, "name": "input_570", "batch_input_shape": [null, 201, 15, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_2839", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2839", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 15]}, "inbound_nodes": [[["input_570", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2840", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2840", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [5, 15]}, "inbound_nodes": [[["input_570", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2839", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2839", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2839", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2840", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2840", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2840", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_570", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_570", "axis": 1}, "inbound_nodes": [[["max_pooling2d_2839", 0, 0, {}], ["max_pooling2d_2840", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_570", "config": {"dtype": "float32", "trainable": true, "name": "flatten_570", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_570", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1528", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1528", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_570", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1529", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1529", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_1528", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1530", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_regularizer": null, "activation": "sigmoid", "dtype": "float32", "use_bias": true, "name": "dense_1530", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_1529", 0, 0, {}]]]}], "name": "model_570", "output_layers": [["dense_1530", 0, 0]]}, "keras_version": "2.2.5"}