{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_60", 0, 0]], "name": "model_20", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 601, 15, 1], "dtype": "float32", "sparse": false, "name": "input_20"}, "name": "input_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"padding": "valid", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "data_format": "channels_last", "kernel_size": [5, 15], "use_bias": true, "strides": [1, 1], "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_40", "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "trainable": true}, "name": "conv2d_40"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "config": {"pool_size": [2, 1], "padding": "valid", "dtype": "float32", "strides": [2, 1], "name": "max_pooling2d_40", "data_format": "channels_last", "trainable": true}, "name": "max_pooling2d_40"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_40", 0, 0, {}]]], "config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "flatten_20"}, "name": "flatten_20"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "dense_58", "units": 128, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "dense_58"}, {"class_name": "Dense", "inbound_nodes": [[["dense_58", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "dense_59", "units": 128, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "dense_59"}, {"class_name": "Dense", "inbound_nodes": [[["dense_59", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "name": "dense_60", "units": 1, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "dense_60"}], "input_layers": [["input_20", 0, 0]]}, "keras_version": "2.2.5"}