{"config": {"output_layers": [["dense_248", 0, 0]], "input_layers": [["input_107", 0, 0]], "name": "model_107", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 601, 15, 1], "name": "input_107", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_107", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_127", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 15], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_127", "inbound_nodes": [[["input_107", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_128", "use_bias": true, "data_format": "channels_last", "kernel_size": [4, 15], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_128", "inbound_nodes": [[["input_107", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_82"}, "class_name": "Concatenate", "name": "concatenate_82", "inbound_nodes": [[["conv2d_127", 0, 0, {}], ["conv2d_128", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_107"}, "class_name": "Flatten", "name": "flatten_107", "inbound_nodes": [[["concatenate_82", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_246", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_246", "inbound_nodes": [[["flatten_107", 0, 0, {}]]]}, {"config": {"name": "dropout_132", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_132", "inbound_nodes": [[["dense_246", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_247", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_247", "inbound_nodes": [[["dropout_132", 0, 0, {}]]]}, {"config": {"name": "dropout_133", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_133", "inbound_nodes": [[["dense_247", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_248", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_248", "inbound_nodes": [[["dropout_133", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}