{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_60", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_20", "config": {"batch_input_shape": [null, 601, 15, 1], "dtype": "float32", "name": "input_20", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_20", 0, 0, {}]]], "name": "conv2d_39", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_39", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 15], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_20", 0, 0, {}]]], "name": "conv2d_40", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_40", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [4, 15], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "trainable": true, "padding": "valid"}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2d_39", 0, 0, {}], ["conv2d_40", 0, 0, {}]]], "name": "concatenate_20", "config": {"dtype": "float32", "name": "concatenate_20", "axis": 1, "trainable": true}}, {"class_name": "Flatten", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "name": "flatten_20", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_20", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "name": "dense_58", "config": {"name": "dense_58", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "units": 128, "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_58", 0, 0, {}]]], "name": "dropout_39", "config": {"noise_shape": null, "dtype": "float32", "name": "dropout_39", "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_39", 0, 0, {}]]], "name": "dense_59", "config": {"name": "dense_59", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "units": 128, "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_59", 0, 0, {}]]], "name": "dropout_40", "config": {"noise_shape": null, "dtype": "float32", "name": "dropout_40", "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_40", 0, 0, {}]]], "name": "dense_60", "config": {"name": "dense_60", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "units": 1, "trainable": true}}], "input_layers": [["input_20", 0, 0]], "name": "model_20"}, "backend": "tensorflow"}