{"config": {"name": "model_3", "layers": [{"name": "input_3", "config": {"name": "input_3", "batch_input_shape": [null, 601, 15, 1], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_7", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 15], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_7", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_8", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 15], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_8", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "dtype": "float32", "axis": 1}, "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "flatten_3", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_6", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "units": 128, "bias_constraint": null, "trainable": true, "name": "dense_6", "dtype": "float32"}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_4", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_4", "dtype": "float32", "rate": 0.5}, "inbound_nodes": [[["dense_6", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_7", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "units": 128, "bias_constraint": null, "trainable": true, "name": "dense_7", "dtype": "float32"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_5", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_5", "dtype": "float32", "rate": 0.5}, "inbound_nodes": [[["dense_7", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_8", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "units": 1, "bias_constraint": null, "trainable": true, "name": "dense_8", "dtype": "float32"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_8", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model"}