{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_30", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_10", "config": {"batch_input_shape": [null, 601, 15, 1], "dtype": "float32", "name": "input_10", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "conv2d_19", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_19", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 15], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "conv2d_20", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_20", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [4, 15], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "trainable": true, "padding": "valid"}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["conv2d_20", 0, 0, {}]]], "name": "concatenate_10", "config": {"dtype": "float32", "name": "concatenate_10", "axis": 1, "trainable": true}}, {"class_name": "Flatten", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "name": "flatten_10", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten_10", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "name": "dense_28", "config": {"name": "dense_28", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "units": 128, "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_28", 0, 0, {}]]], "name": "dropout_19", "config": {"noise_shape": null, "dtype": "float32", "name": "dropout_19", "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_19", 0, 0, {}]]], "name": "dense_29", "config": {"name": "dense_29", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "units": 128, "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_29", 0, 0, {}]]], "name": "dropout_20", "config": {"noise_shape": null, "dtype": "float32", "name": "dropout_20", "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "name": "dense_30", "config": {"name": "dense_30", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "units": 1, "trainable": true}}], "input_layers": [["input_10", 0, 0]], "name": "model_10"}, "backend": "tensorflow"}