{"class_name": "Model", "keras_version": "2.2.5", "config": {"name": "model_102", "layers": [{"name": "input_93", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_93", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 601, 15, 1]}}, {"name": "conv2d_142", "class_name": "Conv2D", "inbound_nodes": [[["input_93", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 15], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_142", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv2d_143", "class_name": "Conv2D", "inbound_nodes": [[["input_93", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4, 15], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_143", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "concatenate_92", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_142", 0, 0, {}], ["conv2d_143", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_92", "dtype": "float32", "trainable": true}}, {"name": "flatten_93", "class_name": "Flatten", "inbound_nodes": [[["concatenate_92", 0, 0, {}]]], "config": {"name": "flatten_93", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_222", "class_name": "Dense", "inbound_nodes": [[["flatten_93", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_222", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dropout_112", "class_name": "Dropout", "inbound_nodes": [[["dense_222", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_112", "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"name": "dense_223", "class_name": "Dense", "inbound_nodes": [[["dropout_112", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_223", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dropout_113", "class_name": "Dropout", "inbound_nodes": [[["dense_223", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_113", "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"name": "dense_224", "class_name": "Dense", "inbound_nodes": [[["dropout_113", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_224", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}], "output_layers": [["dense_224", 0, 0]], "input_layers": [["input_93", 0, 0]]}, "backend": "tensorflow"}