{"keras_version": "2.2.5", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_20", "output_layers": [["dense_40", 0, 0]], "layers": [{"name": "input_20", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 1], "sparse": false, "dtype": "float32", "name": "input_20"}}, {"name": "conv1d_20", "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv1D", "config": {"name": "conv1d_20", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_size": [4], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "dilation_rate": [1], "activation": "relu", "strides": [1]}}, {"name": "flatten_20", "inbound_nodes": [[["conv1d_20", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_20", "data_format": "channels_last", "dtype": "float32", "trainable": true}}, {"name": "dense_39", "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "name": "dense_39", "use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "relu"}}, {"name": "dropout_20", "inbound_nodes": [[["dense_39", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_20", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}}, {"name": "dense_40", "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "name": "dense_40", "use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "sigmoid"}}], "input_layers": [["input_20", 0, 0]]}}