{"config": {"name": "model_5", "layers": [{"name": "input_5", "config": {"name": "input_5", "batch_input_shape": [null, 6, 1], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1d_1", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv1d_1", "kernel_constraint": null, "dilation_rate": [1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "flatten_5", "config": {"trainable": true, "name": "flatten_5", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_11", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "units": 64, "bias_constraint": null, "trainable": true, "name": "dense_11", "dtype": "float32"}, "inbound_nodes": [[["flatten_5", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_7", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_7", "dtype": "float32", "rate": 0.5}, "inbound_nodes": [[["dense_11", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_12", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "units": 1, "bias_constraint": null, "trainable": true, "name": "dense_12", "dtype": "float32"}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["dense_12", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model"}