{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_12", 0, 0]], "name": "model_5", "input_layers": [["input_5", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_5", "class_name": "InputLayer", "config": {"name": "input_5", "batch_input_shape": [null, 6, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_1", "kernel_size": [4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "flatten_5", "class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_5", 0, 0, {}]]], "name": "dense_11", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_11", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 64, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_11", 0, 0, {}]]], "name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "dense_12", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_12", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}