{"keras_version": "2.2.5", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_20", "input_layers": [["simple_input_20", 0, 0], ["DiProDB_input_20", 0, 0], ["IDkmer_input_10", 0, 0], ["DAC_input_10", 0, 0], ["DCC_input_10", 0, 0], ["PC_PseDNC_input_10", 0, 0], ["PC_PseTNC_input_10", 0, 0], ["SC_PseDNC_input_10", 0, 0], ["SC_PseTNC_input_10", 0, 0]], "layers": [{"name": "simple_input_20", "class_name": "InputLayer", "config": {"name": "simple_input_20", "batch_input_shape": [null, 602, 4, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "simple_conv2d_115", "class_name": "Conv2D", "config": {"padding": "valid", "name": "simple_conv2d_115", "activation": "linear", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 602, 4, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [2, 4]}, "inbound_nodes": [[["simple_input_20", 0, 0, {}]]]}, {"name": "simple_conv2d_116", "class_name": "Conv2D", "config": {"padding": "valid", "name": "simple_conv2d_116", "activation": "linear", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 602, 4, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 4]}, "inbound_nodes": [[["simple_input_20", 0, 0, {}]]]}, {"name": "simple_conv2d_117", "class_name": "Conv2D", "config": {"padding": "valid", "name": "simple_conv2d_117", "activation": "linear", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 602, 4, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["simple_input_20", 0, 0, {}]]]}, {"name": "simple_conv2d_118", "class_name": "Conv2D", "config": {"padding": "valid", "name": "simple_conv2d_118", "activation": "linear", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 602, 4, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 4]}, "inbound_nodes": [[["simple_input_20", 0, 0, {}]]]}, {"name": "simple_conv2d_119", "class_name": "Conv2D", "config": {"padding": "valid", "name": "simple_conv2d_119", "activation": "linear", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 602, 4, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [6, 4]}, "inbound_nodes": [[["simple_input_20", 0, 0, {}]]]}, {"name": "simple_conv2d_120", "class_name": "Conv2D", "config": {"padding": "valid", "name": "simple_conv2d_120", "activation": "linear", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 602, 4, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [7, 4]}, "inbound_nodes": [[["simple_input_20", 0, 0, {}]]]}, {"name": "DiProDB_input_20", "class_name": "InputLayer", "config": {"name": "DiProDB_input_20", "batch_input_shape": [null, 601, 15, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "simple_max_pooling2d_115", "class_name": "MaxPooling2D", "config": {"name": "simple_max_pooling2d_115", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1]}, "inbound_nodes": [[["simple_conv2d_115", 0, 0, {}]]]}, {"name": "simple_max_pooling2d_116", "class_name": "MaxPooling2D", "config": {"name": "simple_max_pooling2d_116", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1]}, "inbound_nodes": [[["simple_conv2d_116", 0, 0, {}]]]}, {"name": "simple_max_pooling2d_117", "class_name": "MaxPooling2D", "config": {"name": "simple_max_pooling2d_117", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1]}, "inbound_nodes": [[["simple_conv2d_117", 0, 0, {}]]]}, {"name": "simple_max_pooling2d_118", "class_name": "MaxPooling2D", "config": {"name": "simple_max_pooling2d_118", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1]}, "inbound_nodes": [[["simple_conv2d_118", 0, 0, {}]]]}, {"name": "simple_max_pooling2d_119", "class_name": "MaxPooling2D", "config": {"name": "simple_max_pooling2d_119", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1]}, "inbound_nodes": [[["simple_conv2d_119", 0, 0, {}]]]}, {"name": "simple_max_pooling2d_120", "class_name": "MaxPooling2D", "config": {"name": "simple_max_pooling2d_120", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1]}, "inbound_nodes": [[["simple_conv2d_120", 0, 0, {}]]]}, {"name": "DiProDB_conv2d_39", "class_name": "Conv2D", "config": {"padding": "valid", "name": "DiProDB_conv2d_39", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 15]}, "inbound_nodes": [[["DiProDB_input_20", 0, 0, {}]]]}, {"name": "DiProDB_conv2d_40", "class_name": "Conv2D", "config": {"padding": "valid", "name": "DiProDB_conv2d_40", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [4, 15]}, "inbound_nodes": [[["DiProDB_input_20", 0, 0, {}]]]}, {"name": "DAC_input_10", "class_name": "InputLayer", "config": {"name": "DAC_input_10", "batch_input_shape": [null, 76, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "DCC_input_10", "class_name": "InputLayer", "config": {"name": "DCC_input_10", "batch_input_shape": [null, 1406, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "simple_concatenate_20", "class_name": "Concatenate", "config": {"name": "simple_concatenate_20", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["simple_max_pooling2d_115", 0, 0, {}], ["simple_max_pooling2d_116", 0, 0, {}], ["simple_max_pooling2d_117", 0, 0, {}], ["simple_max_pooling2d_118", 0, 0, {}], ["simple_max_pooling2d_119", 0, 0, {}], ["simple_max_pooling2d_120", 0, 0, {}]]]}, {"name": "DiProDB_concatenate_20", "class_name": "Concatenate", "config": {"name": "DiProDB_concatenate_20", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["DiProDB_conv2d_39", 0, 0, {}], ["DiProDB_conv2d_40", 0, 0, {}]]]}, {"name": "DAC_conv1d_19", "class_name": "Conv1D", "config": {"padding": "valid", "name": "DAC_conv1d_19", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3]}, "inbound_nodes": [[["DAC_input_10", 0, 0, {}]]]}, {"name": "DAC_conv1d_20", "class_name": "Conv1D", "config": {"padding": "valid", "name": "DAC_conv1d_20", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5]}, "inbound_nodes": [[["DAC_input_10", 0, 0, {}]]]}, {"name": "DCC_conv1d_19", "class_name": "Conv1D", "config": {"padding": "valid", "name": "DCC_conv1d_19", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3]}, "inbound_nodes": [[["DCC_input_10", 0, 0, {}]]]}, {"name": "DCC_conv1d_20", "class_name": "Conv1D", "config": {"padding": "valid", "name": "DCC_conv1d_20", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5]}, "inbound_nodes": [[["DCC_input_10", 0, 0, {}]]]}, {"name": "PC_PseDNC_input_10", "class_name": "InputLayer", "config": {"name": "PC_PseDNC_input_10", "batch_input_shape": [null, 18, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "PC_PseTNC_input_10", "class_name": "InputLayer", "config": {"name": "PC_PseTNC_input_10", "batch_input_shape": [null, 66, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "SC_PseDNC_input_10", "class_name": "InputLayer", "config": {"name": "SC_PseDNC_input_10", "batch_input_shape": [null, 92, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "SC_PseTNC_input_10", "class_name": "InputLayer", "config": {"name": "SC_PseTNC_input_10", "batch_input_shape": [null, 88, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "simple_flatten_20", "class_name": "Flatten", "config": {"name": "simple_flatten_20", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["simple_concatenate_20", 0, 0, {}]]]}, {"name": "DiProDB_flatten_20", "class_name": "Flatten", "config": {"name": "DiProDB_flatten_20", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["DiProDB_concatenate_20", 0, 0, {}]]]}, {"name": "IDkmer_input_10", "class_name": "InputLayer", "config": {"name": "IDkmer_input_10", "batch_input_shape": [null, 6, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "DAC_max_pooling1d_19", "class_name": "MaxPooling1D", "config": {"name": "DAC_max_pooling1d_19", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3]}, "inbound_nodes": [[["DAC_conv1d_19", 0, 0, {}]]]}, {"name": "DAC_max_pooling1d_20", "class_name": "MaxPooling1D", "config": {"name": "DAC_max_pooling1d_20", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3]}, "inbound_nodes": [[["DAC_conv1d_20", 0, 0, {}]]]}, {"name": "DCC_max_pooling1d_19", "class_name": "MaxPooling1D", "config": {"name": "DCC_max_pooling1d_19", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3]}, "inbound_nodes": [[["DCC_conv1d_19", 0, 0, {}]]]}, {"name": "DCC_max_pooling1d_20", "class_name": "MaxPooling1D", "config": {"name": "DCC_max_pooling1d_20", "padding": "valid", "trainable": false, "dtype": "float32", "data_format": "channels_last", "pool_size": [3], "strides": [3]}, "inbound_nodes": [[["DCC_conv1d_20", 0, 0, {}]]]}, {"name": "PC_PseDNC_conv1d_28", "class_name": "Conv1D", "config": {"padding": "valid", "name": "PC_PseDNC_conv1d_28", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3]}, "inbound_nodes": [[["PC_PseDNC_input_10", 0, 0, {}]]]}, {"name": "PC_PseDNC_conv1d_29", "class_name": "Conv1D", "config": {"padding": "valid", "name": "PC_PseDNC_conv1d_29", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [4]}, "inbound_nodes": [[["PC_PseDNC_input_10", 0, 0, {}]]]}, {"name": "PC_PseDNC_conv1d_30", "class_name": "Conv1D", "config": {"padding": "valid", "name": "PC_PseDNC_conv1d_30", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5]}, "inbound_nodes": [[["PC_PseDNC_input_10", 0, 0, {}]]]}, {"name": "PC_PseTNC_conv1d_28", "class_name": "Conv1D", "config": {"padding": "valid", "name": "PC_PseTNC_conv1d_28", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3]}, "inbound_nodes": [[["PC_PseTNC_input_10", 0, 0, {}]]]}, {"name": "PC_PseTNC_conv1d_29", "class_name": "Conv1D", "config": {"padding": "valid", "name": "PC_PseTNC_conv1d_29", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [4]}, "inbound_nodes": [[["PC_PseTNC_input_10", 0, 0, {}]]]}, {"name": "PC_PseTNC_conv1d_30", "class_name": "Conv1D", "config": {"padding": "valid", "name": "PC_PseTNC_conv1d_30", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5]}, "inbound_nodes": [[["PC_PseTNC_input_10", 0, 0, {}]]]}, {"name": "SC_PseDNC_conv1d_28", "class_name": "Conv1D", "config": {"padding": "valid", "name": "SC_PseDNC_conv1d_28", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3]}, "inbound_nodes": [[["SC_PseDNC_input_10", 0, 0, {}]]]}, {"name": "SC_PseDNC_conv1d_29", "class_name": "Conv1D", "config": {"padding": "valid", "name": "SC_PseDNC_conv1d_29", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [4]}, "inbound_nodes": [[["SC_PseDNC_input_10", 0, 0, {}]]]}, {"name": "SC_PseDNC_conv1d_30", "class_name": "Conv1D", "config": {"padding": "valid", "name": "SC_PseDNC_conv1d_30", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5]}, "inbound_nodes": [[["SC_PseDNC_input_10", 0, 0, {}]]]}, {"name": "SC_PseTNC_conv1d_28", "class_name": "Conv1D", "config": {"padding": "valid", "name": "SC_PseTNC_conv1d_28", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3]}, "inbound_nodes": [[["SC_PseTNC_input_10", 0, 0, {}]]]}, {"name": "SC_PseTNC_conv1d_29", "class_name": "Conv1D", "config": {"padding": "valid", "name": "SC_PseTNC_conv1d_29", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [4]}, "inbound_nodes": [[["SC_PseTNC_input_10", 0, 0, {}]]]}, {"name": "SC_PseTNC_conv1d_30", "class_name": "Conv1D", "config": {"padding": "valid", "name": "SC_PseTNC_conv1d_30", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5]}, "inbound_nodes": [[["SC_PseTNC_input_10", 0, 0, {}]]]}, {"name": "simple_dense_58", "class_name": "Dense", "config": {"name": "simple_dense_58", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 128, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["simple_flatten_20", 0, 0, {}]]]}, {"name": "DiProDB_dense_58", "class_name": "Dense", "config": {"name": "DiProDB_dense_58", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 128, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["DiProDB_flatten_20", 0, 0, {}]]]}, {"name": "IDkmer_conv1d_10", "class_name": "Conv1D", "config": {"padding": "valid", "name": "IDkmer_conv1d_10", "activation": "relu", "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [4]}, "inbound_nodes": [[["IDkmer_input_10", 0, 0, {}]]]}, {"name": "DAC_concatenate_10", "class_name": "Concatenate", "config": {"name": "DAC_concatenate_10", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["DAC_max_pooling1d_19", 0, 0, {}], ["DAC_max_pooling1d_20", 0, 0, {}]]]}, {"name": "DCC_concatenate_10", "class_name": "Concatenate", "config": {"name": "DCC_concatenate_10", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["DCC_max_pooling1d_19", 0, 0, {}], ["DCC_max_pooling1d_20", 0, 0, {}]]]}, {"name": "PC_PseDNC_concatenate_10", "class_name": "Concatenate", "config": {"name": "PC_PseDNC_concatenate_10", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["PC_PseDNC_conv1d_28", 0, 0, {}], ["PC_PseDNC_conv1d_29", 0, 0, {}], ["PC_PseDNC_conv1d_30", 0, 0, {}]]]}, {"name": "PC_PseTNC_concatenate_10", "class_name": "Concatenate", "config": {"name": "PC_PseTNC_concatenate_10", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["PC_PseTNC_conv1d_28", 0, 0, {}], ["PC_PseTNC_conv1d_29", 0, 0, {}], ["PC_PseTNC_conv1d_30", 0, 0, {}]]]}, {"name": "SC_PseDNC_concatenate_10", "class_name": "Concatenate", "config": {"name": "SC_PseDNC_concatenate_10", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["SC_PseDNC_conv1d_28", 0, 0, {}], ["SC_PseDNC_conv1d_29", 0, 0, {}], ["SC_PseDNC_conv1d_30", 0, 0, {}]]]}, {"name": "SC_PseTNC_concatenate_10", "class_name": "Concatenate", "config": {"name": "SC_PseTNC_concatenate_10", "trainable": false, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["SC_PseTNC_conv1d_28", 0, 0, {}], ["SC_PseTNC_conv1d_29", 0, 0, {}], ["SC_PseTNC_conv1d_30", 0, 0, {}]]]}, {"name": "simple_dropout_39", "class_name": "Dropout", "config": {"name": "simple_dropout_39", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["simple_dense_58", 0, 0, {}]]]}, {"name": "DiProDB_dropout_39", "class_name": "Dropout", "config": {"name": "DiProDB_dropout_39", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["DiProDB_dense_58", 0, 0, {}]]]}, {"name": "IDkmer_flatten_10", "class_name": "Flatten", "config": {"name": "IDkmer_flatten_10", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["IDkmer_conv1d_10", 0, 0, {}]]]}, {"name": "DAC_flatten_10", "class_name": "Flatten", "config": {"name": "DAC_flatten_10", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["DAC_concatenate_10", 0, 0, {}]]]}, {"name": "DCC_flatten_10", "class_name": "Flatten", "config": {"name": "DCC_flatten_10", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["DCC_concatenate_10", 0, 0, {}]]]}, {"name": "PC_PseDNC_flatten_10", "class_name": "Flatten", "config": {"name": "PC_PseDNC_flatten_10", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["PC_PseDNC_concatenate_10", 0, 0, {}]]]}, {"name": "PC_PseTNC_flatten_10", "class_name": "Flatten", "config": {"name": "PC_PseTNC_flatten_10", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["PC_PseTNC_concatenate_10", 0, 0, {}]]]}, {"name": "SC_PseDNC_flatten_10", "class_name": "Flatten", "config": {"name": "SC_PseDNC_flatten_10", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["SC_PseDNC_concatenate_10", 0, 0, {}]]]}, {"name": "SC_PseTNC_flatten_10", "class_name": "Flatten", "config": {"name": "SC_PseTNC_flatten_10", "data_format": "channels_last", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["SC_PseTNC_concatenate_10", 0, 0, {}]]]}, {"name": "simple_dense_59", "class_name": "Dense", "config": {"name": "simple_dense_59", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 128, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["simple_dropout_39", 0, 0, {}]]]}, {"name": "DiProDB_dense_59", "class_name": "Dense", "config": {"name": "DiProDB_dense_59", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 128, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["DiProDB_dropout_39", 0, 0, {}]]]}, {"name": "IDkmer_dense_19", "class_name": "Dense", "config": {"name": "IDkmer_dense_19", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 64, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["IDkmer_flatten_10", 0, 0, {}]]]}, {"name": "DAC_dense_19", "class_name": "Dense", "config": {"name": "DAC_dense_19", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 64, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["DAC_flatten_10", 0, 0, {}]]]}, {"name": "DCC_dense_19", "class_name": "Dense", "config": {"name": "DCC_dense_19", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 64, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["DCC_flatten_10", 0, 0, {}]]]}, {"name": "PC_PseDNC_dense_19", "class_name": "Dense", "config": {"name": "PC_PseDNC_dense_19", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 64, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["PC_PseDNC_flatten_10", 0, 0, {}]]]}, {"name": "PC_PseTNC_dense_19", "class_name": "Dense", "config": {"name": "PC_PseTNC_dense_19", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 64, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["PC_PseTNC_flatten_10", 0, 0, {}]]]}, {"name": "SC_PseDNC_dense_19", "class_name": "Dense", "config": {"name": "SC_PseDNC_dense_19", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 64, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["SC_PseDNC_flatten_10", 0, 0, {}]]]}, {"name": "SC_PseTNC_dense_19", "class_name": "Dense", "config": {"name": "SC_PseTNC_dense_19", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 64, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["SC_PseTNC_flatten_10", 0, 0, {}]]]}, {"name": "simple_dropout_40", "class_name": "Dropout", "config": {"name": "simple_dropout_40", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["simple_dense_59", 0, 0, {}]]]}, {"name": "DiProDB_dropout_40", "class_name": "Dropout", "config": {"name": "DiProDB_dropout_40", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["DiProDB_dense_59", 0, 0, {}]]]}, {"name": "IDkmer_dropout_10", "class_name": "Dropout", "config": {"name": "IDkmer_dropout_10", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["IDkmer_dense_19", 0, 0, {}]]]}, {"name": "DAC_dropout_10", "class_name": "Dropout", "config": {"name": "DAC_dropout_10", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["DAC_dense_19", 0, 0, {}]]]}, {"name": "DCC_dropout_10", "class_name": "Dropout", "config": {"name": "DCC_dropout_10", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["DCC_dense_19", 0, 0, {}]]]}, {"name": "PC_PseDNC_dropout_10", "class_name": "Dropout", "config": {"name": "PC_PseDNC_dropout_10", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["PC_PseDNC_dense_19", 0, 0, {}]]]}, {"name": "PC_PseTNC_dropout_10", "class_name": "Dropout", "config": {"name": "PC_PseTNC_dropout_10", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["PC_PseTNC_dense_19", 0, 0, {}]]]}, {"name": "SC_PseDNC_dropout_10", "class_name": "Dropout", "config": {"name": "SC_PseDNC_dropout_10", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["SC_PseDNC_dense_19", 0, 0, {}]]]}, {"name": "SC_PseTNC_dropout_10", "class_name": "Dropout", "config": {"name": "SC_PseTNC_dropout_10", "seed": null, "trainable": false, "dtype": "float32", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["SC_PseTNC_dense_19", 0, 0, {}]]]}, {"name": "simple_dense_60", "class_name": "Dense", "config": {"name": "simple_dense_60", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["simple_dropout_40", 0, 0, {}]]]}, {"name": "DiProDB_dense_60", "class_name": "Dense", "config": {"name": "DiProDB_dense_60", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["DiProDB_dropout_40", 0, 0, {}]]]}, {"name": "IDkmer_dense_20", "class_name": "Dense", "config": {"name": "IDkmer_dense_20", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["IDkmer_dropout_10", 0, 0, {}]]]}, {"name": "DAC_dense_20", "class_name": "Dense", "config": {"name": "DAC_dense_20", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["DAC_dropout_10", 0, 0, {}]]]}, {"name": "DCC_dense_20", "class_name": "Dense", "config": {"name": "DCC_dense_20", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["DCC_dropout_10", 0, 0, {}]]]}, {"name": "PC_PseDNC_dense_20", "class_name": "Dense", "config": {"name": "PC_PseDNC_dense_20", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["PC_PseDNC_dropout_10", 0, 0, {}]]]}, {"name": "PC_PseTNC_dense_20", "class_name": "Dense", "config": {"name": "PC_PseTNC_dense_20", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["PC_PseTNC_dropout_10", 0, 0, {}]]]}, {"name": "SC_PseDNC_dense_20", "class_name": "Dense", "config": {"name": "SC_PseDNC_dense_20", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["SC_PseDNC_dropout_10", 0, 0, {}]]]}, {"name": "SC_PseTNC_dense_20", "class_name": "Dense", "config": {"name": "SC_PseTNC_dense_20", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["SC_PseTNC_dropout_10", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"name": "concatenate_20", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["simple_dense_60", 0, 0, {}], ["DiProDB_dense_60", 0, 0, {}], ["IDkmer_dense_20", 0, 0, {}], ["DAC_dense_20", 0, 0, {}], ["DCC_dense_20", 0, 0, {}], ["PC_PseDNC_dense_20", 0, 0, {}], ["PC_PseTNC_dense_20", 0, 0, {}], ["SC_PseDNC_dense_20", 0, 0, {}], ["SC_PseTNC_dense_20", 0, 0, {}]]]}, {"name": "dense_39", "class_name": "Dense", "config": {"name": "dense_39", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 4, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"name": "dense_40", "class_name": "Dense", "config": {"name": "dense_40", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "units": 1, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["dense_39", 0, 0, {}]]]}], "output_layers": [["dense_40", 0, 0]]}}