{"class_name": "Model", "keras_version": "2.2.5", "config": {"name": "model_110", "layers": [{"name": "simple_input_91", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "simple_input_91", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 602, 4, 1]}}, {"name": "simple_conv2d_136", "class_name": "Conv2D", "inbound_nodes": [[["simple_input_91", 0, 0, {}]]], "config": {"kernel_size": [2, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "simple_conv2d_136", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "bias_constraint": null, "padding": "valid", "filters": 32, "dtype": "float32"}}, {"name": "simple_conv2d_137", "class_name": "Conv2D", "inbound_nodes": [[["simple_input_91", 0, 0, {}]]], "config": {"kernel_size": [3, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "simple_conv2d_137", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "bias_constraint": null, "padding": "valid", "filters": 32, "dtype": "float32"}}, {"name": "simple_conv2d_138", "class_name": "Conv2D", "inbound_nodes": [[["simple_input_91", 0, 0, {}]]], "config": {"kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "simple_conv2d_138", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "bias_constraint": null, "padding": "valid", "filters": 32, "dtype": "float32"}}, {"name": "simple_conv2d_139", "class_name": "Conv2D", "inbound_nodes": [[["simple_input_91", 0, 0, {}]]], "config": {"kernel_size": [5, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "simple_conv2d_139", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "bias_constraint": null, "padding": "valid", "filters": 32, "dtype": "float32"}}, {"name": "simple_conv2d_140", "class_name": "Conv2D", "inbound_nodes": [[["simple_input_91", 0, 0, {}]]], "config": {"kernel_size": [6, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "simple_conv2d_140", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "bias_constraint": null, "padding": "valid", "filters": 32, "dtype": "float32"}}, {"name": "simple_conv2d_141", "class_name": "Conv2D", "inbound_nodes": [[["simple_input_91", 0, 0, {}]]], "config": {"kernel_size": [7, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "simple_conv2d_141", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "bias_constraint": null, "padding": "valid", "filters": 32, "dtype": "float32"}}, {"name": "DiProDB_input_93", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "DiProDB_input_93", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 601, 15, 1]}}, {"name": "simple_max_pooling2d_136", "class_name": "MaxPooling2D", "inbound_nodes": [[["simple_conv2d_136", 0, 0, {}]]], "config": {"name": "simple_max_pooling2d_136", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "simple_max_pooling2d_137", "class_name": "MaxPooling2D", "inbound_nodes": [[["simple_conv2d_137", 0, 0, {}]]], "config": {"name": "simple_max_pooling2d_137", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "simple_max_pooling2d_138", "class_name": "MaxPooling2D", "inbound_nodes": [[["simple_conv2d_138", 0, 0, {}]]], "config": {"name": "simple_max_pooling2d_138", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "simple_max_pooling2d_139", "class_name": "MaxPooling2D", "inbound_nodes": [[["simple_conv2d_139", 0, 0, {}]]], "config": {"name": "simple_max_pooling2d_139", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "simple_max_pooling2d_140", "class_name": "MaxPooling2D", "inbound_nodes": [[["simple_conv2d_140", 0, 0, {}]]], "config": {"name": "simple_max_pooling2d_140", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "simple_max_pooling2d_141", "class_name": "MaxPooling2D", "inbound_nodes": [[["simple_conv2d_141", 0, 0, {}]]], "config": {"name": "simple_max_pooling2d_141", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "DiProDB_conv2d_142", "class_name": "Conv2D", "inbound_nodes": [[["DiProDB_input_93", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 15], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "DiProDB_conv2d_142", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "DiProDB_conv2d_143", "class_name": "Conv2D", "inbound_nodes": [[["DiProDB_input_93", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4, 15], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "DiProDB_conv2d_143", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "trint_input_94", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "trint_input_94", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 600, 64, 1]}}, {"name": "DAC_input_95", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "DAC_input_95", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 76, 1]}}, {"name": "DCC_input_96", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "DCC_input_96", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1406, 1]}}, {"name": "simple_concatenate_91", "class_name": "Concatenate", "inbound_nodes": [[["simple_max_pooling2d_136", 0, 0, {}], ["simple_max_pooling2d_137", 0, 0, {}], ["simple_max_pooling2d_138", 0, 0, {}], ["simple_max_pooling2d_139", 0, 0, {}], ["simple_max_pooling2d_140", 0, 0, {}], ["simple_max_pooling2d_141", 0, 0, {}]]], "config": {"axis": 1, "name": "simple_concatenate_91", "dtype": "float32", "trainable": false}}, {"name": "DiProDB_concatenate_92", "class_name": "Concatenate", "inbound_nodes": [[["DiProDB_conv2d_142", 0, 0, {}], ["DiProDB_conv2d_143", 0, 0, {}]]], "config": {"axis": 1, "name": "DiProDB_concatenate_92", "dtype": "float32", "trainable": false}}, {"name": "trint_conv2d_144", "class_name": "Conv2D", "inbound_nodes": [[["trint_input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [2, 64], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "trint_conv2d_144", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "trint_conv2d_145", "class_name": "Conv2D", "inbound_nodes": [[["trint_input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 64], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "trint_conv2d_145", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "trint_conv2d_146", "class_name": "Conv2D", "inbound_nodes": [[["trint_input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4, 64], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "trint_conv2d_146", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "trint_conv2d_147", "class_name": "Conv2D", "inbound_nodes": [[["trint_input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5, 64], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "trint_conv2d_147", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "trint_conv2d_148", "class_name": "Conv2D", "inbound_nodes": [[["trint_input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [6, 64], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "trint_conv2d_148", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "trint_conv2d_149", "class_name": "Conv2D", "inbound_nodes": [[["trint_input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [7, 64], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "trint_conv2d_149", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "trint_conv2d_150", "class_name": "Conv2D", "inbound_nodes": [[["trint_input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [8, 64], "strides": [1, 1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "trint_conv2d_150", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "DAC_conv1d_145", "class_name": "Conv1D", "inbound_nodes": [[["DAC_input_95", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "DAC_conv1d_145", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "DAC_conv1d_146", "class_name": "Conv1D", "inbound_nodes": [[["DAC_input_95", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "DAC_conv1d_146", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "DCC_conv1d_147", "class_name": "Conv1D", "inbound_nodes": [[["DCC_input_96", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "DCC_conv1d_147", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "DCC_conv1d_148", "class_name": "Conv1D", "inbound_nodes": [[["DCC_input_96", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "DCC_conv1d_148", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "PC_PseDNC_input_97", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "PC_PseDNC_input_97", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 18, 1]}}, {"name": "PC_PseTNC_input_98", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "PC_PseTNC_input_98", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 66, 1]}}, {"name": "SC_PseDNC_input_99", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "SC_PseDNC_input_99", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 92, 1]}}, {"name": "SC_PseTNC_input_100", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "SC_PseTNC_input_100", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 88, 1]}}, {"name": "simple_flatten_91", "class_name": "Flatten", "inbound_nodes": [[["simple_concatenate_91", 0, 0, {}]]], "config": {"name": "simple_flatten_91", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "DiProDB_flatten_93", "class_name": "Flatten", "inbound_nodes": [[["DiProDB_concatenate_92", 0, 0, {}]]], "config": {"name": "DiProDB_flatten_93", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "trint_max_pooling2d_144", "class_name": "MaxPooling2D", "inbound_nodes": [[["trint_conv2d_144", 0, 0, {}]]], "config": {"name": "trint_max_pooling2d_144", "pool_size": [3, 1], "dtype": "float32", "trainable": false, "strides": [3, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "trint_max_pooling2d_145", "class_name": "MaxPooling2D", "inbound_nodes": [[["trint_conv2d_145", 0, 0, {}]]], "config": {"name": "trint_max_pooling2d_145", "pool_size": [3, 1], "dtype": "float32", "trainable": false, "strides": [3, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "trint_max_pooling2d_146", "class_name": "MaxPooling2D", "inbound_nodes": [[["trint_conv2d_146", 0, 0, {}]]], "config": {"name": "trint_max_pooling2d_146", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "trint_max_pooling2d_147", "class_name": "MaxPooling2D", "inbound_nodes": [[["trint_conv2d_147", 0, 0, {}]]], "config": {"name": "trint_max_pooling2d_147", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "trint_max_pooling2d_148", "class_name": "MaxPooling2D", "inbound_nodes": [[["trint_conv2d_148", 0, 0, {}]]], "config": {"name": "trint_max_pooling2d_148", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "trint_max_pooling2d_149", "class_name": "MaxPooling2D", "inbound_nodes": [[["trint_conv2d_149", 0, 0, {}]]], "config": {"name": "trint_max_pooling2d_149", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "trint_max_pooling2d_150", "class_name": "MaxPooling2D", "inbound_nodes": [[["trint_conv2d_150", 0, 0, {}]]], "config": {"name": "trint_max_pooling2d_150", "pool_size": [2, 1], "dtype": "float32", "trainable": false, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "DAC_max_pooling1d_37", "class_name": "MaxPooling1D", "inbound_nodes": [[["DAC_conv1d_145", 0, 0, {}]]], "config": {"name": "DAC_max_pooling1d_37", "pool_size": [3], "dtype": "float32", "trainable": false, "strides": [3], "data_format": "channels_last", "padding": "valid"}}, {"name": "DAC_max_pooling1d_38", "class_name": "MaxPooling1D", "inbound_nodes": [[["DAC_conv1d_146", 0, 0, {}]]], "config": {"name": "DAC_max_pooling1d_38", "pool_size": [3], "dtype": "float32", "trainable": false, "strides": [3], "data_format": "channels_last", "padding": "valid"}}, {"name": "DCC_max_pooling1d_39", "class_name": "MaxPooling1D", "inbound_nodes": [[["DCC_conv1d_147", 0, 0, {}]]], "config": {"name": "DCC_max_pooling1d_39", "pool_size": [3], "dtype": "float32", "trainable": false, "strides": [3], "data_format": "channels_last", "padding": "valid"}}, {"name": "DCC_max_pooling1d_40", "class_name": "MaxPooling1D", "inbound_nodes": [[["DCC_conv1d_148", 0, 0, {}]]], "config": {"name": "DCC_max_pooling1d_40", "pool_size": [3], "dtype": "float32", "trainable": false, "strides": [3], "data_format": "channels_last", "padding": "valid"}}, {"name": "PC_PseDNC_conv1d_149", "class_name": "Conv1D", "inbound_nodes": [[["PC_PseDNC_input_97", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "PC_PseDNC_conv1d_149", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "PC_PseDNC_conv1d_150", "class_name": "Conv1D", "inbound_nodes": [[["PC_PseDNC_input_97", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "PC_PseDNC_conv1d_150", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "PC_PseDNC_conv1d_151", "class_name": "Conv1D", "inbound_nodes": [[["PC_PseDNC_input_97", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "PC_PseDNC_conv1d_151", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "PC_PseTNC_conv1d_152", "class_name": "Conv1D", "inbound_nodes": [[["PC_PseTNC_input_98", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "PC_PseTNC_conv1d_152", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "PC_PseTNC_conv1d_153", "class_name": "Conv1D", "inbound_nodes": [[["PC_PseTNC_input_98", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "PC_PseTNC_conv1d_153", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "PC_PseTNC_conv1d_154", "class_name": "Conv1D", "inbound_nodes": [[["PC_PseTNC_input_98", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "PC_PseTNC_conv1d_154", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "SC_PseDNC_conv1d_155", "class_name": "Conv1D", "inbound_nodes": [[["SC_PseDNC_input_99", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "SC_PseDNC_conv1d_155", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "SC_PseDNC_conv1d_156", "class_name": "Conv1D", "inbound_nodes": [[["SC_PseDNC_input_99", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "SC_PseDNC_conv1d_156", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "SC_PseDNC_conv1d_157", "class_name": "Conv1D", "inbound_nodes": [[["SC_PseDNC_input_99", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "SC_PseDNC_conv1d_157", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "SC_PseTNC_conv1d_158", "class_name": "Conv1D", "inbound_nodes": [[["SC_PseTNC_input_100", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "SC_PseTNC_conv1d_158", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "SC_PseTNC_conv1d_159", "class_name": "Conv1D", "inbound_nodes": [[["SC_PseTNC_input_100", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "SC_PseTNC_conv1d_159", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "SC_PseTNC_conv1d_160", "class_name": "Conv1D", "inbound_nodes": [[["SC_PseTNC_input_100", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "SC_PseTNC_conv1d_160", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "simple_dense_217", "class_name": "Dense", "inbound_nodes": [[["simple_flatten_91", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "simple_dense_217", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "DiProDB_dense_222", "class_name": "Dense", "inbound_nodes": [[["DiProDB_flatten_93", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "DiProDB_dense_222", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "trint_concatenate_93", "class_name": "Concatenate", "inbound_nodes": [[["trint_max_pooling2d_144", 0, 0, {}], ["trint_max_pooling2d_145", 0, 0, {}], ["trint_max_pooling2d_146", 0, 0, {}], ["trint_max_pooling2d_147", 0, 0, {}], ["trint_max_pooling2d_148", 0, 0, {}], ["trint_max_pooling2d_149", 0, 0, {}], ["trint_max_pooling2d_150", 0, 0, {}]]], "config": {"axis": 1, "name": "trint_concatenate_93", "dtype": "float32", "trainable": false}}, {"name": "DAC_concatenate_94", "class_name": "Concatenate", "inbound_nodes": [[["DAC_max_pooling1d_37", 0, 0, {}], ["DAC_max_pooling1d_38", 0, 0, {}]]], "config": {"axis": 1, "name": "DAC_concatenate_94", "dtype": "float32", "trainable": false}}, {"name": "DCC_concatenate_95", "class_name": "Concatenate", "inbound_nodes": [[["DCC_max_pooling1d_39", 0, 0, {}], ["DCC_max_pooling1d_40", 0, 0, {}]]], "config": {"axis": 1, "name": "DCC_concatenate_95", "dtype": "float32", "trainable": false}}, {"name": "PC_PseDNC_concatenate_96", "class_name": "Concatenate", "inbound_nodes": [[["PC_PseDNC_conv1d_149", 0, 0, {}], ["PC_PseDNC_conv1d_150", 0, 0, {}], ["PC_PseDNC_conv1d_151", 0, 0, {}]]], "config": {"axis": 1, "name": "PC_PseDNC_concatenate_96", "dtype": "float32", "trainable": false}}, {"name": "PC_PseTNC_concatenate_97", "class_name": "Concatenate", "inbound_nodes": [[["PC_PseTNC_conv1d_152", 0, 0, {}], ["PC_PseTNC_conv1d_153", 0, 0, {}], ["PC_PseTNC_conv1d_154", 0, 0, {}]]], "config": {"axis": 1, "name": "PC_PseTNC_concatenate_97", "dtype": "float32", "trainable": false}}, {"name": "SC_PseDNC_concatenate_98", "class_name": "Concatenate", "inbound_nodes": [[["SC_PseDNC_conv1d_155", 0, 0, {}], ["SC_PseDNC_conv1d_156", 0, 0, {}], ["SC_PseDNC_conv1d_157", 0, 0, {}]]], "config": {"axis": 1, "name": "SC_PseDNC_concatenate_98", "dtype": "float32", "trainable": false}}, {"name": "SC_PseTNC_concatenate_99", "class_name": "Concatenate", "inbound_nodes": [[["SC_PseTNC_conv1d_158", 0, 0, {}], ["SC_PseTNC_conv1d_159", 0, 0, {}], ["SC_PseTNC_conv1d_160", 0, 0, {}]]], "config": {"axis": 1, "name": "SC_PseTNC_concatenate_99", "dtype": "float32", "trainable": false}}, {"name": "simple_dropout_109", "class_name": "Dropout", "inbound_nodes": [[["simple_dense_217", 0, 0, {}]]], "config": {"seed": null, "name": "simple_dropout_109", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "DiProDB_dropout_112", "class_name": "Dropout", "inbound_nodes": [[["DiProDB_dense_222", 0, 0, {}]]], "config": {"seed": null, "name": "DiProDB_dropout_112", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "trint_flatten_94", "class_name": "Flatten", "inbound_nodes": [[["trint_concatenate_93", 0, 0, {}]]], "config": {"name": "trint_flatten_94", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "DAC_flatten_95", "class_name": "Flatten", "inbound_nodes": [[["DAC_concatenate_94", 0, 0, {}]]], "config": {"name": "DAC_flatten_95", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "DCC_flatten_96", "class_name": "Flatten", "inbound_nodes": [[["DCC_concatenate_95", 0, 0, {}]]], "config": {"name": "DCC_flatten_96", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "PC_PseDNC_flatten_97", "class_name": "Flatten", "inbound_nodes": [[["PC_PseDNC_concatenate_96", 0, 0, {}]]], "config": {"name": "PC_PseDNC_flatten_97", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "PC_PseTNC_flatten_98", "class_name": "Flatten", "inbound_nodes": [[["PC_PseTNC_concatenate_97", 0, 0, {}]]], "config": {"name": "PC_PseTNC_flatten_98", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "SC_PseDNC_flatten_99", "class_name": "Flatten", "inbound_nodes": [[["SC_PseDNC_concatenate_98", 0, 0, {}]]], "config": {"name": "SC_PseDNC_flatten_99", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "SC_PseTNC_flatten_100", "class_name": "Flatten", "inbound_nodes": [[["SC_PseTNC_concatenate_99", 0, 0, {}]]], "config": {"name": "SC_PseTNC_flatten_100", "dtype": "float32", "trainable": false, "data_format": "channels_last"}}, {"name": "simple_dense_218", "class_name": "Dense", "inbound_nodes": [[["simple_dropout_109", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "simple_dense_218", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "DiProDB_dense_223", "class_name": "Dense", "inbound_nodes": [[["DiProDB_dropout_112", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "DiProDB_dense_223", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "trint_dense_225", "class_name": "Dense", "inbound_nodes": [[["trint_flatten_94", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "trint_dense_225", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "DAC_dense_227", "class_name": "Dense", "inbound_nodes": [[["DAC_flatten_95", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "DAC_dense_227", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "DCC_dense_229", "class_name": "Dense", "inbound_nodes": [[["DCC_flatten_96", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "DCC_dense_229", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "PC_PseDNC_dense_231", "class_name": "Dense", "inbound_nodes": [[["PC_PseDNC_flatten_97", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "PC_PseDNC_dense_231", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "PC_PseTNC_dense_233", "class_name": "Dense", "inbound_nodes": [[["PC_PseTNC_flatten_98", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "PC_PseTNC_dense_233", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "SC_PseDNC_dense_235", "class_name": "Dense", "inbound_nodes": [[["SC_PseDNC_flatten_99", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "SC_PseDNC_dense_235", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "SC_PseTNC_dense_237", "class_name": "Dense", "inbound_nodes": [[["SC_PseTNC_flatten_100", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "SC_PseTNC_dense_237", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "simple_dropout_110", "class_name": "Dropout", "inbound_nodes": [[["simple_dense_218", 0, 0, {}]]], "config": {"seed": null, "name": "simple_dropout_110", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "DiProDB_dropout_113", "class_name": "Dropout", "inbound_nodes": [[["DiProDB_dense_223", 0, 0, {}]]], "config": {"seed": null, "name": "DiProDB_dropout_113", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "trint_dropout_114", "class_name": "Dropout", "inbound_nodes": [[["trint_dense_225", 0, 0, {}]]], "config": {"seed": null, "name": "trint_dropout_114", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "DAC_dropout_115", "class_name": "Dropout", "inbound_nodes": [[["DAC_dense_227", 0, 0, {}]]], "config": {"seed": null, "name": "DAC_dropout_115", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "DCC_dropout_116", "class_name": "Dropout", "inbound_nodes": [[["DCC_dense_229", 0, 0, {}]]], "config": {"seed": null, "name": "DCC_dropout_116", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "PC_PseDNC_dropout_117", "class_name": "Dropout", "inbound_nodes": [[["PC_PseDNC_dense_231", 0, 0, {}]]], "config": {"seed": null, "name": "PC_PseDNC_dropout_117", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "PC_PseTNC_dropout_118", "class_name": "Dropout", "inbound_nodes": [[["PC_PseTNC_dense_233", 0, 0, {}]]], "config": {"seed": null, "name": "PC_PseTNC_dropout_118", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "SC_PseDNC_dropout_119", "class_name": "Dropout", "inbound_nodes": [[["SC_PseDNC_dense_235", 0, 0, {}]]], "config": {"seed": null, "name": "SC_PseDNC_dropout_119", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "SC_PseTNC_dropout_120", "class_name": "Dropout", "inbound_nodes": [[["SC_PseTNC_dense_237", 0, 0, {}]]], "config": {"seed": null, "name": "SC_PseTNC_dropout_120", "dtype": "float32", "trainable": false, "rate": 0.5, "noise_shape": null}}, {"name": "simple_dense_219", "class_name": "Dense", "inbound_nodes": [[["simple_dropout_110", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "simple_dense_219", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "DiProDB_dense_224", "class_name": "Dense", "inbound_nodes": [[["DiProDB_dropout_113", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "DiProDB_dense_224", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "trint_dense_226", "class_name": "Dense", "inbound_nodes": [[["trint_dropout_114", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "trint_dense_226", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "DAC_dense_228", "class_name": "Dense", "inbound_nodes": [[["DAC_dropout_115", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "DAC_dense_228", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "DCC_dense_230", "class_name": "Dense", "inbound_nodes": [[["DCC_dropout_116", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "DCC_dense_230", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "PC_PseDNC_dense_232", "class_name": "Dense", "inbound_nodes": [[["PC_PseDNC_dropout_117", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "PC_PseDNC_dense_232", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "PC_PseTNC_dense_234", "class_name": "Dense", "inbound_nodes": [[["PC_PseTNC_dropout_118", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "PC_PseTNC_dense_234", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "SC_PseDNC_dense_236", "class_name": "Dense", "inbound_nodes": [[["SC_PseDNC_dropout_119", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "SC_PseDNC_dense_236", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "SC_PseTNC_dense_238", "class_name": "Dense", "inbound_nodes": [[["SC_PseTNC_dropout_120", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "SC_PseTNC_dense_238", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "concatenate_100", "class_name": "Concatenate", "inbound_nodes": [[["simple_dense_219", 0, 0, {}], ["DiProDB_dense_224", 0, 0, {}], ["trint_dense_226", 0, 0, {}], ["DAC_dense_228", 0, 0, {}], ["DCC_dense_230", 0, 0, {}], ["PC_PseDNC_dense_232", 0, 0, {}], ["PC_PseTNC_dense_234", 0, 0, {}], ["SC_PseDNC_dense_236", 0, 0, {}], ["SC_PseTNC_dense_238", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_100", "dtype": "float32", "trainable": true}}, {"name": "dense_239", "class_name": "Dense", "inbound_nodes": [[["concatenate_100", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_239", "activation": "relu", "dtype": "float32", "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dense_240", "class_name": "Dense", "inbound_nodes": [[["dense_239", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_240", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}], "output_layers": [["dense_240", 0, 0]], "input_layers": [["simple_input_91", 0, 0], ["DiProDB_input_93", 0, 0], ["trint_input_94", 0, 0], ["DAC_input_95", 0, 0], ["DCC_input_96", 0, 0], ["PC_PseDNC_input_97", 0, 0], ["PC_PseTNC_input_98", 0, 0], ["SC_PseDNC_input_99", 0, 0], ["SC_PseTNC_input_100", 0, 0]]}, "backend": "tensorflow"}