{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "name": "input_10", "batch_input_shape": [null, 18, 1], "sparse": false}, "name": "input_10", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_28", "use_bias": true, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3], "bias_constraint": null}, "name": "conv1d_28", "class_name": "Conv1D", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_29", "use_bias": true, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [4], "bias_constraint": null}, "name": "conv1d_29", "class_name": "Conv1D", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_30", "use_bias": true, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [5], "bias_constraint": null}, "name": "conv1d_30", "class_name": "Conv1D", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"config": {"axis": 1, "dtype": "float32", "name": "concatenate_10", "trainable": true}, "name": "concatenate_10", "class_name": "Concatenate", "inbound_nodes": [[["conv1d_28", 0, 0, {}], ["conv1d_29", 0, 0, {}], ["conv1d_30", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "dtype": "float32", "name": "flatten_10", "trainable": true}, "name": "flatten_10", "class_name": "Flatten", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_19", "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "units": 64, "activation": "relu", "bias_constraint": null}, "name": "dense_19", "class_name": "Dense", "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_10", "dtype": "float32", "rate": 0.5}, "name": "dropout_10", "class_name": "Dropout", "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_20", "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "units": 1, "activation": "sigmoid", "bias_constraint": null}, "name": "dense_20", "class_name": "Dense", "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "name": "model_10", "output_layers": [["dense_20", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.5"}