{"class_name": "Model", "keras_version": "2.2.5", "config": {"name": "model_106", "layers": [{"name": "input_97", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_97", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 18, 1]}}, {"name": "conv1d_149", "class_name": "Conv1D", "inbound_nodes": [[["input_97", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_149", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv1d_150", "class_name": "Conv1D", "inbound_nodes": [[["input_97", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_150", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv1d_151", "class_name": "Conv1D", "inbound_nodes": [[["input_97", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_151", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "concatenate_96", "class_name": "Concatenate", "inbound_nodes": [[["conv1d_149", 0, 0, {}], ["conv1d_150", 0, 0, {}], ["conv1d_151", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_96", "dtype": "float32", "trainable": true}}, {"name": "flatten_97", "class_name": "Flatten", "inbound_nodes": [[["concatenate_96", 0, 0, {}]]], "config": {"name": "flatten_97", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_231", "class_name": "Dense", "inbound_nodes": [[["flatten_97", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_231", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dropout_117", "class_name": "Dropout", "inbound_nodes": [[["dense_231", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_117", "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"name": "dense_232", "class_name": "Dense", "inbound_nodes": [[["dropout_117", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_232", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}], "output_layers": [["dense_232", 0, 0]], "input_layers": [["input_97", 0, 0]]}, "backend": "tensorflow"}