{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_20", 0, 0]], "name": "model_9", "input_layers": [["input_9", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_9", "class_name": "InputLayer", "config": {"name": "input_9", "batch_input_shape": [null, 66, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "conv1d_9", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_9", "kernel_size": [3], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "conv1d_10", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_10", "kernel_size": [4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "conv1d_11", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_11", "kernel_size": [5], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1d_9", 0, 0, {}], ["conv1d_10", 0, 0, {}], ["conv1d_11", 0, 0, {}]]], "name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "name": "flatten_9", "class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_9", 0, 0, {}]]], "name": "dense_19", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_19", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 64, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_19", 0, 0, {}]]], "name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_11", 0, 0, {}]]], "name": "dense_20", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_20", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}