{"config": {"output_layers": [["dense_266", 0, 0]], "input_layers": [["input_115", 0, 0]], "name": "model_115", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 66, 1], "name": "input_115", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_115", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_172", "use_bias": true, "data_format": "channels_last", "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_172", "inbound_nodes": [[["input_115", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_173", "use_bias": true, "data_format": "channels_last", "kernel_size": [4], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_173", "inbound_nodes": [[["input_115", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_174", "use_bias": true, "data_format": "channels_last", "kernel_size": [5], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_174", "inbound_nodes": [[["input_115", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_88"}, "class_name": "Concatenate", "name": "concatenate_88", "inbound_nodes": [[["conv1d_172", 0, 0, {}], ["conv1d_173", 0, 0, {}], ["conv1d_174", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_115"}, "class_name": "Flatten", "name": "flatten_115", "inbound_nodes": [[["concatenate_88", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_265", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_265", "inbound_nodes": [[["flatten_115", 0, 0, {}]]]}, {"config": {"name": "dropout_142", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_142", "inbound_nodes": [[["dense_265", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_266", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_266", "inbound_nodes": [[["dropout_142", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}