{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_18", 0, 0]], "name": "model_8", "input_layers": [["input_8", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_8", "class_name": "InputLayer", "config": {"name": "input_8", "batch_input_shape": [null, 18, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "conv1d_6", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_6", "kernel_size": [3], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "conv1d_7", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_7", "kernel_size": [4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "conv1d_8", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_8", "kernel_size": [5], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1d_6", 0, 0, {}], ["conv1d_7", 0, 0, {}], ["conv1d_8", 0, 0, {}]]], "name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "flatten_8", "class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_8", 0, 0, {}]]], "name": "dense_17", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_17", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 64, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_17", 0, 0, {}]]], "name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "dense_18", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_18", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}