{"keras_version": "2.2.5", "backend": "tensorflow", "config": {"name": "model_10", "output_layers": [["dense_20", 0, 0]], "layers": [{"name": "input_10", "inbound_nodes": [], "config": {"batch_input_shape": [null, 66, 1], "dtype": "float32", "name": "input_10", "sparse": false}, "class_name": "InputLayer"}, {"name": "conv1d_28", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"kernel_size": [3], "bias_constraint": null, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_28", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "padding": "valid", "trainable": true, "filters": 32}, "class_name": "Conv1D"}, {"name": "conv1d_29", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"kernel_size": [4], "bias_constraint": null, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_29", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "padding": "valid", "trainable": true, "filters": 32}, "class_name": "Conv1D"}, {"name": "conv1d_30", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"kernel_size": [5], "bias_constraint": null, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_30", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "padding": "valid", "trainable": true, "filters": 32}, "class_name": "Conv1D"}, {"name": "concatenate_10", "inbound_nodes": [[["conv1d_28", 0, 0, {}], ["conv1d_29", 0, 0, {}], ["conv1d_30", 0, 0, {}]]], "config": {"trainable": true, "axis": 1, "name": "concatenate_10", "dtype": "float32"}, "class_name": "Concatenate"}, {"name": "flatten_10", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_10", "dtype": "float32"}, "class_name": "Flatten"}, {"name": "dense_19", "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_19", "dtype": "float32", "kernel_constraint": null, "trainable": true, "units": 64}, "class_name": "Dense"}, {"name": "dropout_10", "inbound_nodes": [[["dense_19", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_10", "rate": 0.5, "dtype": "float32", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"name": "dense_20", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_20", "dtype": "float32", "kernel_constraint": null, "trainable": true, "units": 1}, "class_name": "Dense"}], "input_layers": [["input_10", 0, 0]]}, "class_name": "Model"}