{"class_name": "Model", "keras_version": "2.2.5", "config": {"name": "model_107", "layers": [{"name": "input_98", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_98", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 66, 1]}}, {"name": "conv1d_152", "class_name": "Conv1D", "inbound_nodes": [[["input_98", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_152", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv1d_153", "class_name": "Conv1D", "inbound_nodes": [[["input_98", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_153", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv1d_154", "class_name": "Conv1D", "inbound_nodes": [[["input_98", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_154", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "concatenate_97", "class_name": "Concatenate", "inbound_nodes": [[["conv1d_152", 0, 0, {}], ["conv1d_153", 0, 0, {}], ["conv1d_154", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_97", "dtype": "float32", "trainable": true}}, {"name": "flatten_98", "class_name": "Flatten", "inbound_nodes": [[["concatenate_97", 0, 0, {}]]], "config": {"name": "flatten_98", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_233", "class_name": "Dense", "inbound_nodes": [[["flatten_98", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_233", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dropout_118", "class_name": "Dropout", "inbound_nodes": [[["dense_233", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_118", "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"name": "dense_234", "class_name": "Dense", "inbound_nodes": [[["dropout_118", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_234", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}], "output_layers": [["dense_234", 0, 0]], "input_layers": [["input_98", 0, 0]]}, "backend": "tensorflow"}