{"keras_version": "2.2.5", "backend": "tensorflow", "config": {"name": "model_20", "output_layers": [["dense_40", 0, 0]], "layers": [{"name": "input_20", "inbound_nodes": [], "config": {"batch_input_shape": [null, 66, 1], "dtype": "float32", "name": "input_20", "sparse": false}, "class_name": "InputLayer"}, {"name": "conv1d_58", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"kernel_size": [3], "bias_constraint": null, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_58", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "padding": "valid", "trainable": true, "filters": 32}, "class_name": "Conv1D"}, {"name": "conv1d_59", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"kernel_size": [4], "bias_constraint": null, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_59", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "padding": "valid", "trainable": true, "filters": 32}, "class_name": "Conv1D"}, {"name": "conv1d_60", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"kernel_size": [5], "bias_constraint": null, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_60", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "padding": "valid", "trainable": true, "filters": 32}, "class_name": "Conv1D"}, {"name": "concatenate_20", "inbound_nodes": [[["conv1d_58", 0, 0, {}], ["conv1d_59", 0, 0, {}], ["conv1d_60", 0, 0, {}]]], "config": {"trainable": true, "axis": 1, "name": "concatenate_20", "dtype": "float32"}, "class_name": "Concatenate"}, {"name": "flatten_20", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_20", "dtype": "float32"}, "class_name": "Flatten"}, {"name": "dense_39", "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_39", "dtype": "float32", "kernel_constraint": null, "trainable": true, "units": 64}, "class_name": "Dense"}, {"name": "dropout_20", "inbound_nodes": [[["dense_39", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_20", "rate": 0.5, "dtype": "float32", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"name": "dense_40", "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_40", "dtype": "float32", "kernel_constraint": null, "trainable": true, "units": 1}, "class_name": "Dense"}], "input_layers": [["input_20", 0, 0]]}, "class_name": "Model"}