{"class_name": "Model", "keras_version": "2.2.5", "config": {"output_layers": [["dense_236", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_108", "config": {"sparse": false, "batch_input_shape": [null, 66, 1], "dtype": "float32", "name": "input_108"}}, {"inbound_nodes": [[["input_108", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_162", "config": {"name": "conv1d_162", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [3], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["input_108", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_163", "config": {"name": "conv1d_163", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [4], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["input_108", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_164", "config": {"name": "conv1d_164", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [5], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_162", 0, 0, {}], ["conv1d_163", 0, 0, {}], ["conv1d_164", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_88", "config": {"trainable": true, "axis": 1, "name": "concatenate_88", "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_88", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_108", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_108", "dtype": "float32"}}, {"inbound_nodes": [[["flatten_108", 0, 0, {}]]], "class_name": "Dense", "name": "dense_235", "config": {"name": "dense_235", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_235", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_128", "config": {"name": "dropout_128", "dtype": "float32", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"inbound_nodes": [[["dropout_128", 0, 0, {}]]], "class_name": "Dense", "name": "dense_236", "config": {"name": "dense_236", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_108", "input_layers": [["input_108", 0, 0]]}, "backend": "tensorflow"}