{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 17, 1]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "flatten_1", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 64, "trainable": true, "activation": "relu", "dtype": "float32", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_3", "config": {"dtype": "float32", "seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.5}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_4", "config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 1, "trainable": true, "activation": "sigmoid", "dtype": "float32", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense"}]}, "keras_version": "2.2.5", "class_name": "Model"}