{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "name": "input_20", "batch_input_shape": [null, 18, 1], "sparse": false}, "name": "input_20", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_58", "use_bias": true, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3], "bias_constraint": null}, "name": "conv1d_58", "class_name": "Conv1D", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_59", "use_bias": true, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [4], "bias_constraint": null}, "name": "conv1d_59", "class_name": "Conv1D", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "dilation_rate": [1], "activity_regularizer": null, "name": "conv1d_60", "use_bias": true, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [5], "bias_constraint": null}, "name": "conv1d_60", "class_name": "Conv1D", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"config": {"axis": 1, "dtype": "float32", "name": "concatenate_20", "trainable": true}, "name": "concatenate_20", "class_name": "Concatenate", "inbound_nodes": [[["conv1d_58", 0, 0, {}], ["conv1d_59", 0, 0, {}], ["conv1d_60", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "dtype": "float32", "name": "flatten_20", "trainable": true}, "name": "flatten_20", "class_name": "Flatten", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_39", "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "units": 64, "activation": "relu", "bias_constraint": null}, "name": "dense_39", "class_name": "Dense", "inbound_nodes": [[["flatten_20", 0, 0, {}]]]}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_20", "dtype": "float32", "rate": 0.5}, "name": "dropout_20", "class_name": "Dropout", "inbound_nodes": [[["dense_39", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_40", "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "units": 1, "activation": "sigmoid", "bias_constraint": null}, "name": "dense_40", "class_name": "Dense", "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}], "input_layers": [["input_20", 0, 0]], "name": "model_20", "output_layers": [["dense_40", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.5"}