{"config": {"output_layers": [["dense_262", 0, 0]], "input_layers": [["input_113", 0, 0]], "name": "model_113", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 17, 1], "name": "input_113", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_113", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_166", "use_bias": true, "data_format": "channels_last", "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_166", "inbound_nodes": [[["input_113", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_167", "use_bias": true, "data_format": "channels_last", "kernel_size": [4], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_167", "inbound_nodes": [[["input_113", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_168", "use_bias": true, "data_format": "channels_last", "kernel_size": [5], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_168", "inbound_nodes": [[["input_113", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_86"}, "class_name": "Concatenate", "name": "concatenate_86", "inbound_nodes": [[["conv1d_166", 0, 0, {}], ["conv1d_167", 0, 0, {}], ["conv1d_168", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_113"}, "class_name": "Flatten", "name": "flatten_113", "inbound_nodes": [[["concatenate_86", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_261", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_261", "inbound_nodes": [[["flatten_113", 0, 0, {}]]]}, {"config": {"name": "dropout_140", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_140", "inbound_nodes": [[["dense_261", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_262", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_262", "inbound_nodes": [[["dropout_140", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}