{"backend": "tensorflow", "config": {"name": "model_10", "input_layers": [["input_10", 0, 0]], "layers": [{"name": "input_10", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 92, 1], "dtype": "float32", "name": "input_10"}, "class_name": "InputLayer"}, {"name": "conv1d_28", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "conv1d_28", "kernel_size": [3], "data_format": "channels_last", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv1D"}, {"name": "conv1d_29", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "conv1d_29", "kernel_size": [4], "data_format": "channels_last", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv1D"}, {"name": "conv1d_30", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "conv1d_30", "kernel_size": [5], "data_format": "channels_last", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv1D"}, {"name": "concatenate_10", "inbound_nodes": [[["conv1d_28", 0, 0, {}], ["conv1d_29", 0, 0, {}], ["conv1d_30", 0, 0, {}]]], "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": 1}, "class_name": "Concatenate"}, {"name": "flatten_10", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "config": {"name": "flatten_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten"}, {"name": "dense_19", "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_19", "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "dropout_10", "inbound_nodes": [[["dense_19", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout_10", "dtype": "float32", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"name": "dense_20", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_20", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}], "output_layers": [["dense_20", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.5"}