{"backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_20", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_10", "config": {"sparse": false, "batch_input_shape": [null, 88, 1], "dtype": "float32", "name": "input_10"}}, {"inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_28", "config": {"data_format": "channels_last", "kernel_size": [3], "dilation_rate": [1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "trainable": true, "name": "conv1d_28", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_29", "config": {"data_format": "channels_last", "kernel_size": [4], "dilation_rate": [1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "trainable": true, "name": "conv1d_29", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_30", "config": {"data_format": "channels_last", "kernel_size": [5], "dilation_rate": [1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "trainable": true, "name": "conv1d_30", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["conv1d_28", 0, 0, {}], ["conv1d_29", 0, 0, {}], ["conv1d_30", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_10", "config": {"axis": 1, "trainable": true, "name": "concatenate_10", "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_10", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_10", "dtype": "float32"}}, {"inbound_nodes": [[["flatten_10", 0, 0, {}]]], "class_name": "Dense", "name": "dense_19", "config": {"use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "activation": "relu"}}, {"inbound_nodes": [[["dense_19", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_10", "config": {"rate": 0.5, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_10", "dtype": "float32"}}, {"inbound_nodes": [[["dropout_10", 0, 0, {}]]], "class_name": "Dense", "name": "dense_20", "config": {"use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_20", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "activation": "sigmoid"}}], "name": "model_10", "input_layers": [["input_10", 0, 0]]}}