{"backend": "tensorflow", "config": {"name": "model_20", "input_layers": [["input_20", 0, 0]], "layers": [{"name": "input_20", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 92, 1], "dtype": "float32", "name": "input_20"}, "class_name": "InputLayer"}, {"name": "conv1d_58", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "conv1d_58", "kernel_size": [3], "data_format": "channels_last", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv1D"}, {"name": "conv1d_59", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "conv1d_59", "kernel_size": [4], "data_format": "channels_last", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv1D"}, {"name": "conv1d_60", "inbound_nodes": [[["input_20", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "filters": 32, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "name": "conv1d_60", "kernel_size": [5], "data_format": "channels_last", "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv1D"}, {"name": "concatenate_20", "inbound_nodes": [[["conv1d_58", 0, 0, {}], ["conv1d_59", 0, 0, {}], ["conv1d_60", 0, 0, {}]]], "config": {"name": "concatenate_20", "trainable": true, "dtype": "float32", "axis": 1}, "class_name": "Concatenate"}, {"name": "flatten_20", "inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "config": {"name": "flatten_20", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten"}, {"name": "dense_39", "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_39", "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "dropout_20", "inbound_nodes": [[["dense_39", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout_20", "dtype": "float32", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"name": "dense_40", "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_40", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}], "output_layers": [["dense_40", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.5"}