{"config": {"output_layers": [["dense_570", 0, 0]], "input_layers": [["input_247", 0, 0]], "name": "model_247", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 88, 1], "name": "input_247", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_247", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_378", "use_bias": true, "data_format": "channels_last", "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_378", "inbound_nodes": [[["input_247", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_379", "use_bias": true, "data_format": "channels_last", "kernel_size": [4], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_379", "inbound_nodes": [[["input_247", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_380", "use_bias": true, "data_format": "channels_last", "kernel_size": [5], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_380", "inbound_nodes": [[["input_247", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_190"}, "class_name": "Concatenate", "name": "concatenate_190", "inbound_nodes": [[["conv1d_378", 0, 0, {}], ["conv1d_379", 0, 0, {}], ["conv1d_380", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_247"}, "class_name": "Flatten", "name": "flatten_247", "inbound_nodes": [[["concatenate_190", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_569", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_569", "inbound_nodes": [[["flatten_247", 0, 0, {}]]]}, {"config": {"name": "dropout_304", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_304", "inbound_nodes": [[["dense_569", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_570", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_570", "inbound_nodes": [[["dropout_304", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}