{"class_name": "Model", "keras_version": "2.2.5", "config": {"output_layers": [["dense_238", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_109", "config": {"sparse": false, "batch_input_shape": [null, 92, 1], "dtype": "float32", "name": "input_109"}}, {"inbound_nodes": [[["input_109", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_165", "config": {"name": "conv1d_165", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [3], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["input_109", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_166", "config": {"name": "conv1d_166", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [4], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["input_109", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_167", "config": {"name": "conv1d_167", "dilation_rate": [1], "trainable": true, "use_bias": true, "strides": [1], "kernel_regularizer": null, "kernel_size": [5], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "relu", "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_165", 0, 0, {}], ["conv1d_166", 0, 0, {}], ["conv1d_167", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_89", "config": {"trainable": true, "axis": 1, "name": "concatenate_89", "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_89", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_109", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_109", "dtype": "float32"}}, {"inbound_nodes": [[["flatten_109", 0, 0, {}]]], "class_name": "Dense", "name": "dense_237", "config": {"name": "dense_237", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_237", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_129", "config": {"name": "dropout_129", "dtype": "float32", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"inbound_nodes": [[["dropout_129", 0, 0, {}]]], "class_name": "Dense", "name": "dense_238", "config": {"name": "dense_238", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_109", "input_layers": [["input_109", 0, 0]]}, "backend": "tensorflow"}