{"backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_10", "config": {"dtype": "float32", "batch_input_shape": [null, 92, 1], "name": "input_10", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv1D", "name": "conv1d_28", "config": {"dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "data_format": "channels_last", "name": "conv1d_28", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_size": [3], "use_bias": true}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_29", "config": {"dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "data_format": "channels_last", "name": "conv1d_29", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_size": [4], "use_bias": true}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_30", "config": {"dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "data_format": "channels_last", "name": "conv1d_30", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_size": [5], "use_bias": true}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_10", "config": {"dtype": "float32", "trainable": true, "axis": 1, "name": "concatenate_10"}, "inbound_nodes": [[["conv1d_28", 0, 0, {}], ["conv1d_29", 0, 0, {}], ["conv1d_30", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_10", "config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten_10"}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_19", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "trainable": true, "activation": "relu", "units": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_19", "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_10", "config": {"rate": 0.5, "dtype": "float32", "trainable": true, "noise_shape": null, "name": "dropout_10", "seed": null}, "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_20", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "trainable": true, "activation": "sigmoid", "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_20", "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["dense_20", 0, 0]], "name": "model_10"}}