{"backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_40", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_20", "config": {"sparse": false, "batch_input_shape": [null, 88, 1], "dtype": "float32", "name": "input_20"}}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_58", "config": {"data_format": "channels_last", "kernel_size": [3], "dilation_rate": [1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "trainable": true, "name": "conv1d_58", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_59", "config": {"data_format": "channels_last", "kernel_size": [4], "dilation_rate": [1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "trainable": true, "name": "conv1d_59", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_60", "config": {"data_format": "channels_last", "kernel_size": [5], "dilation_rate": [1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "filters": 32, "trainable": true, "name": "conv1d_60", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu"}}, {"inbound_nodes": [[["conv1d_58", 0, 0, {}], ["conv1d_59", 0, 0, {}], ["conv1d_60", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_20", "config": {"axis": 1, "trainable": true, "name": "concatenate_20", "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_20", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_20", "dtype": "float32"}}, {"inbound_nodes": [[["flatten_20", 0, 0, {}]]], "class_name": "Dense", "name": "dense_39", "config": {"use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_39", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "activation": "relu"}}, {"inbound_nodes": [[["dense_39", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_20", "config": {"rate": 0.5, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_20", "dtype": "float32"}}, {"inbound_nodes": [[["dropout_20", 0, 0, {}]]], "class_name": "Dense", "name": "dense_40", "config": {"use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_40", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "activation": "sigmoid"}}], "name": "model_20", "input_layers": [["input_20", 0, 0]]}}