{"class_name": "Model", "keras_version": "2.2.5", "config": {"name": "model_109", "layers": [{"name": "input_100", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_100", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 88, 1]}}, {"name": "conv1d_158", "class_name": "Conv1D", "inbound_nodes": [[["input_100", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_158", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv1d_159", "class_name": "Conv1D", "inbound_nodes": [[["input_100", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_159", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv1d_160", "class_name": "Conv1D", "inbound_nodes": [[["input_100", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5], "strides": [1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1d_160", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "concatenate_99", "class_name": "Concatenate", "inbound_nodes": [[["conv1d_158", 0, 0, {}], ["conv1d_159", 0, 0, {}], ["conv1d_160", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_99", "dtype": "float32", "trainable": true}}, {"name": "flatten_100", "class_name": "Flatten", "inbound_nodes": [[["concatenate_99", 0, 0, {}]]], "config": {"name": "flatten_100", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_237", "class_name": "Dense", "inbound_nodes": [[["flatten_100", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_237", "activation": "relu", "dtype": "float32", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dropout_120", "class_name": "Dropout", "inbound_nodes": [[["dense_237", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_120", "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"name": "dense_238", "class_name": "Dense", "inbound_nodes": [[["dropout_120", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_238", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}], "output_layers": [["dense_238", 0, 0]], "input_layers": [["input_100", 0, 0]]}, "backend": "tensorflow"}