{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_24", 0, 0]], "name": "model_11", "input_layers": [["input_11", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_11", "class_name": "InputLayer", "config": {"name": "input_11", "batch_input_shape": [null, 88, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "conv1d_15", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_15", "kernel_size": [3], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "conv1d_16", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_16", "kernel_size": [4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "conv1d_17", "class_name": "Conv1D", "config": {"filters": 32, "name": "conv1d_17", "kernel_size": [5], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1d_15", 0, 0, {}], ["conv1d_16", 0, 0, {}], ["conv1d_17", 0, 0, {}]]], "name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "name": "flatten_11", "class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_11", 0, 0, {}]]], "name": "dense_23", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_23", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 64, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_23", 0, 0, {}]]], "name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_13", 0, 0, {}]]], "name": "dense_24", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_24", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}