{"backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 602, 4, 1], "sparse": false, "name": "input_10", "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv2d_55", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [2, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_55", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "conv2d_56", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [3, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_56", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "conv2d_57", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [4, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_57", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "conv2d_58", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [5, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_58", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "conv2d_59", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [6, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_59", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "conv2d_60", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [7, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_60", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "max_pooling2d_55", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_55", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_55", 0, 0, {}]]]}, {"name": "max_pooling2d_56", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_56", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_56", 0, 0, {}]]]}, {"name": "max_pooling2d_57", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_57", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_57", 0, 0, {}]]]}, {"name": "max_pooling2d_58", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_58", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_58", 0, 0, {}]]]}, {"name": "max_pooling2d_59", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_59", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_59", 0, 0, {}]]]}, {"name": "max_pooling2d_60", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_60", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_60", 0, 0, {}]]]}, {"name": "concatenate_10", "class_name": "Concatenate", "config": {"axis": 1, "trainable": true, "name": "concatenate_10", "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_55", 0, 0, {}], ["max_pooling2d_56", 0, 0, {}], ["max_pooling2d_57", 0, 0, {}], ["max_pooling2d_58", 0, 0, {}], ["max_pooling2d_59", 0, 0, {}], ["max_pooling2d_60", 0, 0, {}]]]}, {"name": "flatten_10", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "dense_28", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 128, "activation": "relu", "name": "dense_28", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null, "dtype": "float32"}, "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 128, "activation": "relu", "name": "dense_29", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null, "dtype": "float32"}, "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 1, "activation": "sigmoid", "name": "dense_30", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["dense_30", 0, 0]]}}