{"backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model", "config": {"name": "model_20", "layers": [{"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 602, 4, 1], "sparse": false, "name": "input_20", "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv2d_115", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [2, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_115", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "conv2d_116", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [3, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_116", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "conv2d_117", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [4, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_117", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "conv2d_118", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [5, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_118", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "conv2d_119", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [6, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_119", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "conv2d_120", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [7, 4], "strides": [1, 1], "trainable": true, "activation": "linear", "batch_input_shape": [null, 602, 4, 1], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "conv2d_120", "bias_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "max_pooling2d_115", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_115", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_115", 0, 0, {}]]]}, {"name": "max_pooling2d_116", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_116", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_116", 0, 0, {}]]]}, {"name": "max_pooling2d_117", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_117", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_117", 0, 0, {}]]]}, {"name": "max_pooling2d_118", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_118", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_118", 0, 0, {}]]]}, {"name": "max_pooling2d_119", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_119", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_119", 0, 0, {}]]]}, {"name": "max_pooling2d_120", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_120", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 1], "strides": [2, 1], "dtype": "float32"}, "inbound_nodes": [[["conv2d_120", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"axis": 1, "trainable": true, "name": "concatenate_20", "dtype": "float32"}, "inbound_nodes": [[["max_pooling2d_115", 0, 0, {}], ["max_pooling2d_116", 0, 0, {}], ["max_pooling2d_117", 0, 0, {}], ["max_pooling2d_118", 0, 0, {}], ["max_pooling2d_119", 0, 0, {}], ["max_pooling2d_120", 0, 0, {}]]]}, {"name": "flatten_20", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_20", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"name": "dense_58", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 128, "activation": "relu", "name": "dense_58", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["flatten_20", 0, 0, {}]]]}, {"name": "dropout_39", "class_name": "Dropout", "config": {"name": "dropout_39", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null, "dtype": "float32"}, "inbound_nodes": [[["dense_58", 0, 0, {}]]]}, {"name": "dense_59", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 128, "activation": "relu", "name": "dense_59", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["dropout_39", 0, 0, {}]]]}, {"name": "dropout_40", "class_name": "Dropout", "config": {"name": "dropout_40", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null, "dtype": "float32"}, "inbound_nodes": [[["dense_59", 0, 0, {}]]]}, {"name": "dense_60", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 1, "activation": "sigmoid", "name": "dense_60", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32"}, "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}], "input_layers": [["input_20", 0, 0]], "output_layers": [["dense_60", 0, 0]]}}