{"config": {"output_layers": [["dense_543", 0, 0]], "input_layers": [["input_235", 0, 0]], "name": "model_235", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 602, 4, 1], "name": "input_235", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_235", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_271", "use_bias": true, "data_format": "channels_last", "kernel_size": [2, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_271", "inbound_nodes": [[["input_235", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_272", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_272", "inbound_nodes": [[["input_235", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_273", "use_bias": true, "data_format": "channels_last", "kernel_size": [4, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_273", "inbound_nodes": [[["input_235", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_274", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_274", "inbound_nodes": [[["input_235", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_275", "use_bias": true, "data_format": "channels_last", "kernel_size": [6, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_275", "inbound_nodes": [[["input_235", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_276", "use_bias": true, "data_format": "channels_last", "kernel_size": [7, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_276", "inbound_nodes": [[["input_235", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_271", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_271", "inbound_nodes": [[["conv2d_271", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_272", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_272", "inbound_nodes": [[["conv2d_272", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_273", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_273", "inbound_nodes": [[["conv2d_273", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_274", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_274", "inbound_nodes": [[["conv2d_274", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_275", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_275", "inbound_nodes": [[["conv2d_275", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_276", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_276", "inbound_nodes": [[["conv2d_276", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_181"}, "class_name": "Concatenate", "name": "concatenate_181", "inbound_nodes": [[["max_pooling2d_271", 0, 0, {}], ["max_pooling2d_272", 0, 0, {}], ["max_pooling2d_273", 0, 0, {}], ["max_pooling2d_274", 0, 0, {}], ["max_pooling2d_275", 0, 0, {}], ["max_pooling2d_276", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_235"}, "class_name": "Flatten", "name": "flatten_235", "inbound_nodes": [[["concatenate_181", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_541", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_541", "inbound_nodes": [[["flatten_235", 0, 0, {}]]]}, {"config": {"name": "dropout_289", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_289", "inbound_nodes": [[["dense_541", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_542", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_542", "inbound_nodes": [[["dropout_289", 0, 0, {}]]]}, {"config": {"name": "dropout_290", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_290", "inbound_nodes": [[["dense_542", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_543", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_543", "inbound_nodes": [[["dropout_290", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}