{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_550", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_550", "config": {"dtype": "float32", "sparse": false, "name": "input_550", "batch_input_shape": [null, 202, 4, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_2755", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2755", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [2, 4]}, "inbound_nodes": [[["input_550", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2756", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2756", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 4]}, "inbound_nodes": [[["input_550", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2757", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2757", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["input_550", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2758", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2758", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [5, 4]}, "inbound_nodes": [[["input_550", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2759", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2759", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [6, 4]}, "inbound_nodes": [[["input_550", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2760", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2760", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [7, 4]}, "inbound_nodes": [[["input_550", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2755", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2755", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2755", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2756", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2756", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2756", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2757", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2757", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2757", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2758", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2758", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2758", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2759", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2759", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2759", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2760", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2760", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2760", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_550", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_550", "axis": 1}, "inbound_nodes": [[["max_pooling2d_2755", 0, 0, {}], ["max_pooling2d_2756", 0, 0, {}], ["max_pooling2d_2757", 0, 0, {}], ["max_pooling2d_2758", 0, 0, {}], ["max_pooling2d_2759", 0, 0, {}], ["max_pooling2d_2760", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_550", "config": {"dtype": "float32", "trainable": true, "name": "flatten_550", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_550", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1468", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1468", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_550", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_559", "config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_559", "rate": 0.5, "noise_shape": null}, "inbound_nodes": [[["dense_1468", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1469", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1469", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_559", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_560", "config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_560", "rate": 0.5, "noise_shape": null}, "inbound_nodes": [[["dense_1469", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1470", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_regularizer": null, "activation": "sigmoid", "dtype": "float32", "use_bias": true, "name": "dense_1470", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_560", 0, 0, {}]]]}], "name": "model_550", "output_layers": [["dense_1470", 0, 0]]}, "keras_version": "2.2.5"}