{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_560", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_560", "config": {"dtype": "float32", "sparse": false, "name": "input_560", "batch_input_shape": [null, 202, 4, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_2815", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2815", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [2, 4]}, "inbound_nodes": [[["input_560", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2816", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2816", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 4]}, "inbound_nodes": [[["input_560", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2817", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2817", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["input_560", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2818", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2818", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [5, 4]}, "inbound_nodes": [[["input_560", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2819", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2819", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [6, 4]}, "inbound_nodes": [[["input_560", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2820", "config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 602, 4, 1], "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2820", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_size": [7, 4]}, "inbound_nodes": [[["input_560", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2815", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2815", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2815", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2816", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2816", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2816", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2817", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2817", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2817", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2818", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2818", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2818", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2819", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2819", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2819", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2820", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2820", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2820", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_560", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_560", "axis": 1}, "inbound_nodes": [[["max_pooling2d_2815", 0, 0, {}], ["max_pooling2d_2816", 0, 0, {}], ["max_pooling2d_2817", 0, 0, {}], ["max_pooling2d_2818", 0, 0, {}], ["max_pooling2d_2819", 0, 0, {}], ["max_pooling2d_2820", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_560", "config": {"dtype": "float32", "trainable": true, "name": "flatten_560", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_560", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1498", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1498", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_560", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_579", "config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_579", "rate": 0.5, "noise_shape": null}, "inbound_nodes": [[["dense_1498", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1499", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1499", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_579", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_580", "config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_580", "rate": 0.5, "noise_shape": null}, "inbound_nodes": [[["dense_1499", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1500", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_regularizer": null, "activation": "sigmoid", "dtype": "float32", "use_bias": true, "name": "dense_1500", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_580", 0, 0, {}]]]}], "name": "model_560", "output_layers": [["dense_1500", 0, 0]]}, "keras_version": "2.2.5"}