{"config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 602, 4, 1], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 602, 4, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [2, 4], "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_1", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "filters": 32}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_2", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 602, 4, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 4], "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_2", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "filters": 32}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_3", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 602, 4, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_3", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "filters": 32}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_4", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 602, 4, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 4], "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_4", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "filters": 32}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_5", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 602, 4, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [6, 4], "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_5", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "filters": 32}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_6", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 602, 4, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [7, 4], "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_6", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "filters": 32}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_2", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_3", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_4", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_4", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_5", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_5", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_6", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_6", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "dtype": "float32", "axis": 1}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}], ["max_pooling2d_4", 0, 0, {}], ["max_pooling2d_5", 0, 0, {}], ["max_pooling2d_6", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "flatten_1", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "units": 128, "bias_constraint": null, "trainable": true, "name": "dense_1", "dtype": "float32"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_1", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "dtype": "float32", "rate": 0.5}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "units": 128, "bias_constraint": null, "trainable": true, "name": "dense_2", "dtype": "float32"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_2", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "dtype": "float32", "rate": 0.5}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "units": 1, "bias_constraint": null, "trainable": true, "name": "dense_3", "dtype": "float32"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model"}