{"config": {"output_layers": [["dense_243", 0, 0]], "input_layers": [["input_105", 0, 0]], "name": "model_105", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 602, 4, 1], "name": "input_105", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_105", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_121", "use_bias": true, "data_format": "channels_last", "kernel_size": [2, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_121", "inbound_nodes": [[["input_105", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_122", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_122", "inbound_nodes": [[["input_105", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_123", "use_bias": true, "data_format": "channels_last", "kernel_size": [4, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_123", "inbound_nodes": [[["input_105", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_124", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_124", "inbound_nodes": [[["input_105", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_125", "use_bias": true, "data_format": "channels_last", "kernel_size": [6, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_125", "inbound_nodes": [[["input_105", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 602, 4, 1], "name": "conv2d_126", "use_bias": true, "data_format": "channels_last", "kernel_size": [7, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_126", "inbound_nodes": [[["input_105", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_121", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_121", "inbound_nodes": [[["conv2d_121", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_122", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_122", "inbound_nodes": [[["conv2d_122", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_123", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_123", "inbound_nodes": [[["conv2d_123", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_124", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_124", "inbound_nodes": [[["conv2d_124", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_125", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_125", "inbound_nodes": [[["conv2d_125", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_126", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_126", "inbound_nodes": [[["conv2d_126", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_81"}, "class_name": "Concatenate", "name": "concatenate_81", "inbound_nodes": [[["max_pooling2d_121", 0, 0, {}], ["max_pooling2d_122", 0, 0, {}], ["max_pooling2d_123", 0, 0, {}], ["max_pooling2d_124", 0, 0, {}], ["max_pooling2d_125", 0, 0, {}], ["max_pooling2d_126", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_105"}, "class_name": "Flatten", "name": "flatten_105", "inbound_nodes": [[["concatenate_81", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_241", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_241", "inbound_nodes": [[["flatten_105", 0, 0, {}]]]}, {"config": {"name": "dropout_129", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_129", "inbound_nodes": [[["dense_241", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_242", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_242", "inbound_nodes": [[["dropout_129", 0, 0, {}]]]}, {"config": {"name": "dropout_130", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_130", "inbound_nodes": [[["dense_242", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_243", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_243", "inbound_nodes": [[["dropout_130", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}