{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 602, 4, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_1", "kernel_size": [2, 4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "batch_input_shape": [null, 602, 4, 1], "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_2", "kernel_size": [3, 4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "batch_input_shape": [null, 602, 4, 1], "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_3", "kernel_size": [4, 4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "batch_input_shape": [null, 602, 4, 1], "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_4", "kernel_size": [5, 4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "batch_input_shape": [null, 602, 4, 1], "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_5", "kernel_size": [6, 4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "batch_input_shape": [null, 602, 4, 1], "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_6", "kernel_size": [7, 4], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "batch_input_shape": [null, 602, 4, 1], "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}], ["max_pooling2d_4", 0, 0, {}], ["max_pooling2d_5", 0, 0, {}], ["max_pooling2d_6", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_3", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}