{"config": {"layers": [{"config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 36, 1], "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 64, "activation": "relu", "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "dtype": "float32", "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "activation": "sigmoid", "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "bias_constraint": null}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "output_layers": [["dense_4", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model"}