{"config": {"output_layers": [["dense_258", 0, 0]], "input_layers": [["input_111", 0, 0]], "name": "model_111", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 36, 1], "name": "input_111", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_111", "inbound_nodes": []}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_111"}, "class_name": "Flatten", "name": "flatten_111", "inbound_nodes": [[["input_111", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_255", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_255", "inbound_nodes": [[["flatten_111", 0, 0, {}]]]}, {"config": {"name": "dropout_139", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_139", "inbound_nodes": [[["dense_255", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_258", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_258", "inbound_nodes": [[["dropout_139", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}