{"config": {"output_layers": [["dense_560", 0, 0]], "input_layers": [["input_242", 0, 0]], "name": "model_242", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 264, 1], "name": "input_242", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_242", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_364", "use_bias": true, "data_format": "channels_last", "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_364", "inbound_nodes": [[["input_242", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_365", "use_bias": true, "data_format": "channels_last", "kernel_size": [5], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_365", "inbound_nodes": [[["input_242", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_75", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_75", "inbound_nodes": [[["conv1d_364", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_76", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_76", "inbound_nodes": [[["conv1d_365", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_185"}, "class_name": "Concatenate", "name": "concatenate_185", "inbound_nodes": [[["max_pooling1d_75", 0, 0, {}], ["max_pooling1d_76", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_242"}, "class_name": "Flatten", "name": "flatten_242", "inbound_nodes": [[["concatenate_185", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_559", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_559", "inbound_nodes": [[["flatten_242", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_560", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_560", "inbound_nodes": [[["dense_559", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}