{"config": {"output_layers": [["dense_260", 0, 0]], "input_layers": [["input_112", 0, 0]], "name": "model_112", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 264, 1], "name": "input_112", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_112", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_164", "use_bias": true, "data_format": "channels_last", "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_164", "inbound_nodes": [[["input_112", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv1d_165", "use_bias": true, "data_format": "channels_last", "kernel_size": [5], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1], "padding": "valid", "strides": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv1D", "name": "conv1d_165", "inbound_nodes": [[["input_112", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_35", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_35", "inbound_nodes": [[["conv1d_164", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling1d_36", "pool_size": [3], "data_format": "channels_last", "strides": [3], "padding": "valid"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_36", "inbound_nodes": [[["conv1d_165", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_85"}, "class_name": "Concatenate", "name": "concatenate_85", "inbound_nodes": [[["max_pooling1d_35", 0, 0, {}], ["max_pooling1d_36", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_112"}, "class_name": "Flatten", "name": "flatten_112", "inbound_nodes": [[["concatenate_85", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_259", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 64, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_259", "inbound_nodes": [[["flatten_112", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_260", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_260", "inbound_nodes": [[["dense_259", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}