{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_600", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_600", "config": {"dtype": "float32", "sparse": false, "name": "input_600", "batch_input_shape": [null, 200, 64, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_2994", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2994", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [2, 64]}, "inbound_nodes": [[["input_600", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2995", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2995", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 64]}, "inbound_nodes": [[["input_600", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2996", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2996", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [4, 64]}, "inbound_nodes": [[["input_600", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2997", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2997", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [5, 64]}, "inbound_nodes": [[["input_600", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2998", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2998", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [6, 64]}, "inbound_nodes": [[["input_600", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2999", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2999", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [7, 64]}, "inbound_nodes": [[["input_600", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3000", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_3000", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [8, 64]}, "inbound_nodes": [[["input_600", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2994", "config": {"dtype": "float32", "trainable": true, "pool_size": [3, 1], "name": "max_pooling2d_2994", "strides": [3, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2994", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2995", "config": {"dtype": "float32", "trainable": true, "pool_size": [3, 1], "name": "max_pooling2d_2995", "strides": [3, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2995", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2996", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2996", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2996", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2997", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2997", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2997", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2998", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2998", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2998", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2999", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2999", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2999", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3000", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_3000", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3000", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_600", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_600", "axis": 1}, "inbound_nodes": [[["max_pooling2d_2994", 0, 0, {}], ["max_pooling2d_2995", 0, 0, {}], ["max_pooling2d_2996", 0, 0, {}], ["max_pooling2d_2997", 0, 0, {}], ["max_pooling2d_2998", 0, 0, {}], ["max_pooling2d_2999", 0, 0, {}], ["max_pooling2d_3000", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_600", "config": {"dtype": "float32", "trainable": true, "name": "flatten_600", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_600", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1599", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1599", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_600", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_600", "config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_600", "rate": 0.5, "noise_shape": null}, "inbound_nodes": [[["dense_1599", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1600", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_regularizer": null, "activation": "sigmoid", "dtype": "float32", "use_bias": true, "name": "dense_1600", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_600", 0, 0, {}]]]}], "name": "model_600", "output_layers": [["dense_1600", 0, 0]]}, "keras_version": "2.2.5"}