{"config": {"output_layers": [["dense_250", 0, 0]], "input_layers": [["input_108", 0, 0]], "name": "model_108", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 600, 64, 1], "name": "input_108", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_108", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_129", "use_bias": true, "data_format": "channels_last", "kernel_size": [2, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_129", "inbound_nodes": [[["input_108", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_130", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_130", "inbound_nodes": [[["input_108", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_131", "use_bias": true, "data_format": "channels_last", "kernel_size": [4, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_131", "inbound_nodes": [[["input_108", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_132", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_132", "inbound_nodes": [[["input_108", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_133", "use_bias": true, "data_format": "channels_last", "kernel_size": [6, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_133", "inbound_nodes": [[["input_108", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_134", "use_bias": true, "data_format": "channels_last", "kernel_size": [7, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_134", "inbound_nodes": [[["input_108", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_135", "use_bias": true, "data_format": "channels_last", "kernel_size": [8, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_135", "inbound_nodes": [[["input_108", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_129", "strides": [3, 1], "pool_size": [3, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_129", "inbound_nodes": [[["conv2d_129", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_130", "strides": [3, 1], "pool_size": [3, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_130", "inbound_nodes": [[["conv2d_130", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_131", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_131", "inbound_nodes": [[["conv2d_131", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_132", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_132", "inbound_nodes": [[["conv2d_132", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_133", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_133", "inbound_nodes": [[["conv2d_133", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_134", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_134", "inbound_nodes": [[["conv2d_134", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_135", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_135", "inbound_nodes": [[["conv2d_135", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_83"}, "class_name": "Concatenate", "name": "concatenate_83", "inbound_nodes": [[["max_pooling2d_129", 0, 0, {}], ["max_pooling2d_130", 0, 0, {}], ["max_pooling2d_131", 0, 0, {}], ["max_pooling2d_132", 0, 0, {}], ["max_pooling2d_133", 0, 0, {}], ["max_pooling2d_134", 0, 0, {}], ["max_pooling2d_135", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_108"}, "class_name": "Flatten", "name": "flatten_108", "inbound_nodes": [[["concatenate_83", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_249", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_249", "inbound_nodes": [[["flatten_108", 0, 0, {}]]]}, {"config": {"name": "dropout_134", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_134", "inbound_nodes": [[["dense_249", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_250", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_250", "inbound_nodes": [[["dropout_134", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}