{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_590", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_590", "config": {"dtype": "float32", "sparse": false, "name": "input_590", "batch_input_shape": [null, 200, 64, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_2924", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2924", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [2, 64]}, "inbound_nodes": [[["input_590", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2925", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2925", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 64]}, "inbound_nodes": [[["input_590", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2926", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2926", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [4, 64]}, "inbound_nodes": [[["input_590", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2927", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2927", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [5, 64]}, "inbound_nodes": [[["input_590", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2928", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2928", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [6, 64]}, "inbound_nodes": [[["input_590", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2929", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2929", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [7, 64]}, "inbound_nodes": [[["input_590", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2930", "config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_2930", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [8, 64]}, "inbound_nodes": [[["input_590", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2924", "config": {"dtype": "float32", "trainable": true, "pool_size": [3, 1], "name": "max_pooling2d_2924", "strides": [3, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2924", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2925", "config": {"dtype": "float32", "trainable": true, "pool_size": [3, 1], "name": "max_pooling2d_2925", "strides": [3, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2925", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2926", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2926", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2926", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2927", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2927", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2927", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2928", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2928", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2928", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2929", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2929", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2929", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2930", "config": {"dtype": "float32", "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_2930", "strides": [2, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2930", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_590", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_590", "axis": 1}, "inbound_nodes": [[["max_pooling2d_2924", 0, 0, {}], ["max_pooling2d_2925", 0, 0, {}], ["max_pooling2d_2926", 0, 0, {}], ["max_pooling2d_2927", 0, 0, {}], ["max_pooling2d_2928", 0, 0, {}], ["max_pooling2d_2929", 0, 0, {}], ["max_pooling2d_2930", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_590", "config": {"dtype": "float32", "trainable": true, "name": "flatten_590", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_590", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1579", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "use_bias": true, "name": "dense_1579", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_590", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_590", "config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_590", "rate": 0.5, "noise_shape": null}, "inbound_nodes": [[["dense_1579", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1580", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_regularizer": null, "activation": "sigmoid", "dtype": "float32", "use_bias": true, "name": "dense_1580", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_590", 0, 0, {}]]]}], "name": "model_590", "output_layers": [["dense_1580", 0, 0]]}, "keras_version": "2.2.5"}