{"class_name": "Model", "keras_version": "2.2.5", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_10", "batch_input_shape": [null, 600, 64, 1]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_10"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [2, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_64"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_64"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_65"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_65"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [4, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_66"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_66"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [5, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_67"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_67"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [6, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_68"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_68"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [7, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_69"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_69"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [8, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_70"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_70"}, {"config": {"padding": "valid", "strides": [3, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_64", "pool_size": [3, 1]}, "inbound_nodes": [[["conv2d_64", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_64"}, {"config": {"padding": "valid", "strides": [3, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_65", "pool_size": [3, 1]}, "inbound_nodes": [[["conv2d_65", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_65"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_66", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_66", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_66"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_67", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_67", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_67"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_68", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_68", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_68"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_69", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_69", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_69"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_70", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_70", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_70"}, {"config": {"dtype": "float32", "axis": 1, "trainable": true, "name": "concatenate_10"}, "inbound_nodes": [[["max_pooling2d_64", 0, 0, {}], ["max_pooling2d_65", 0, 0, {}], ["max_pooling2d_66", 0, 0, {}], ["max_pooling2d_67", 0, 0, {}], ["max_pooling2d_68", 0, 0, {}], ["max_pooling2d_69", 0, 0, {}], ["max_pooling2d_70", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_10"}, {"config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "flatten_10"}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_10"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "bias_regularizer": null, "activation": "relu", "name": "dense_19"}, "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "class_name": "Dense", "name": "dense_19"}, {"config": {"noise_shape": null, "rate": 0.5, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_10"}, "inbound_nodes": [[["dense_19", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_10"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "activation": "sigmoid", "name": "dense_20"}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "class_name": "Dense", "name": "dense_20"}], "input_layers": [["input_10", 0, 0]], "name": "model_10", "output_layers": [["dense_20", 0, 0]]}, "backend": "tensorflow"}