{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_10", 0, 0]], "name": "model_4", "input_layers": [["input_4", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_4", "class_name": "InputLayer", "config": {"name": "input_4", "batch_input_shape": [null, 600, 64, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_9", "kernel_size": [2, 64], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_10", "kernel_size": [3, 64], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_11", "kernel_size": [4, 64], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_12", "kernel_size": [5, 64], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_13", "kernel_size": [6, 64], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_14", "kernel_size": [7, 64], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_15", "kernel_size": [8, 64], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [3, 1], "strides": [3, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "max_pooling2d_10", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [3, 1], "strides": [3, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "max_pooling2d_11", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_11", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "max_pooling2d_12", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_12", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "max_pooling2d_13", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "max_pooling2d_14", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "max_pooling2d_15", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_15", "trainable": true, "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 1], "strides": [2, 1], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_9", 0, 0, {}], ["max_pooling2d_10", 0, 0, {}], ["max_pooling2d_11", 0, 0, {}], ["max_pooling2d_12", 0, 0, {}], ["max_pooling2d_13", 0, 0, {}], ["max_pooling2d_14", 0, 0, {}], ["max_pooling2d_15", 0, 0, {}]]], "name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "axis": 1, "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_4", 0, 0, {}]]], "name": "dense_9", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_9", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_9", 0, 0, {}]]], "name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.5}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dense_10", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_10", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "kernel_constraint": null}}]}, "backend": "tensorflow"}