{"keras_version": "2.2.5", "class_name": "Model", "config": {"output_layers": [["dense_40", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 64, 1], "sparse": false, "dtype": "float32", "name": "input_20"}, "name": "input_20"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "activation": "relu", "kernel_size": [2, 64], "name": "conv2d_134", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32}, "name": "conv2d_134"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "activation": "relu", "kernel_size": [3, 64], "name": "conv2d_135", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32}, "name": "conv2d_135"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "activation": "relu", "kernel_size": [4, 64], "name": "conv2d_136", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32}, "name": "conv2d_136"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "activation": "relu", "kernel_size": [5, 64], "name": "conv2d_137", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32}, "name": "conv2d_137"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "activation": "relu", "kernel_size": [6, 64], "name": "conv2d_138", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32}, "name": "conv2d_138"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "activation": "relu", "kernel_size": [7, 64], "name": "conv2d_139", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32}, "name": "conv2d_139"}, {"inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "activation": "relu", "kernel_size": [8, 64], "name": "conv2d_140", "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32}, "name": "conv2d_140"}, {"inbound_nodes": [[["conv2d_134", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_134", "data_format": "channels_last", "trainable": true, "strides": [3, 1], "padding": "valid", "pool_size": [3, 1]}, "name": "max_pooling2d_134"}, {"inbound_nodes": [[["conv2d_135", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_135", "data_format": "channels_last", "trainable": true, "strides": [3, 1], "padding": "valid", "pool_size": [3, 1]}, "name": "max_pooling2d_135"}, {"inbound_nodes": [[["conv2d_136", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_136", "data_format": "channels_last", "trainable": true, "strides": [2, 1], "padding": "valid", "pool_size": [2, 1]}, "name": "max_pooling2d_136"}, {"inbound_nodes": [[["conv2d_137", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_137", "data_format": "channels_last", "trainable": true, "strides": [2, 1], "padding": "valid", "pool_size": [2, 1]}, "name": "max_pooling2d_137"}, {"inbound_nodes": [[["conv2d_138", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_138", "data_format": "channels_last", "trainable": true, "strides": [2, 1], "padding": "valid", "pool_size": [2, 1]}, "name": "max_pooling2d_138"}, {"inbound_nodes": [[["conv2d_139", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_139", "data_format": "channels_last", "trainable": true, "strides": [2, 1], "padding": "valid", "pool_size": [2, 1]}, "name": "max_pooling2d_139"}, {"inbound_nodes": [[["conv2d_140", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_140", "data_format": "channels_last", "trainable": true, "strides": [2, 1], "padding": "valid", "pool_size": [2, 1]}, "name": "max_pooling2d_140"}, {"inbound_nodes": [[["max_pooling2d_134", 0, 0, {}], ["max_pooling2d_135", 0, 0, {}], ["max_pooling2d_136", 0, 0, {}], ["max_pooling2d_137", 0, 0, {}], ["max_pooling2d_138", 0, 0, {}], ["max_pooling2d_139", 0, 0, {}], ["max_pooling2d_140", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 1, "dtype": "float32", "name": "concatenate_20", "trainable": true}, "name": "concatenate_20"}, {"inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_20", "data_format": "channels_last", "trainable": true}, "name": "flatten_20"}, {"inbound_nodes": [[["flatten_20", 0, 0, {}]]], "class_name": "Dense", "config": {"dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "name": "dense_39", "use_bias": true, "bias_constraint": null, "units": 128, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}, "name": "dense_39"}, {"inbound_nodes": [[["dense_39", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_20"}, "name": "dropout_20"}, {"inbound_nodes": [[["dropout_20", 0, 0, {}]]], "class_name": "Dense", "config": {"dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_40", "use_bias": true, "bias_constraint": null, "units": 1, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}, "name": "dense_40"}], "input_layers": [["input_20", 0, 0]], "name": "model_20"}, "backend": "tensorflow"}