{"class_name": "Model", "keras_version": "2.2.5", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_20", "batch_input_shape": [null, 600, 64, 1]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_20"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [2, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_134"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_134"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_135"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_135"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [4, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_136"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_136"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [5, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_137"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_137"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [6, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_138"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_138"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [7, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_139"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_139"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_size": [8, 64], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "name": "conv2d_140"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_140"}, {"config": {"padding": "valid", "strides": [3, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_134", "pool_size": [3, 1]}, "inbound_nodes": [[["conv2d_134", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_134"}, {"config": {"padding": "valid", "strides": [3, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_135", "pool_size": [3, 1]}, "inbound_nodes": [[["conv2d_135", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_135"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_136", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_136", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_136"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_137", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_137", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_137"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_138", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_138", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_138"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_139", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_139", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_139"}, {"config": {"padding": "valid", "strides": [2, 1], "data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "max_pooling2d_140", "pool_size": [2, 1]}, "inbound_nodes": [[["conv2d_140", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_140"}, {"config": {"dtype": "float32", "axis": 1, "trainable": true, "name": "concatenate_20"}, "inbound_nodes": [[["max_pooling2d_134", 0, 0, {}], ["max_pooling2d_135", 0, 0, {}], ["max_pooling2d_136", 0, 0, {}], ["max_pooling2d_137", 0, 0, {}], ["max_pooling2d_138", 0, 0, {}], ["max_pooling2d_139", 0, 0, {}], ["max_pooling2d_140", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_20"}, {"config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "flatten_20"}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_20"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "bias_regularizer": null, "activation": "relu", "name": "dense_39"}, "inbound_nodes": [[["flatten_20", 0, 0, {}]]], "class_name": "Dense", "name": "dense_39"}, {"config": {"noise_shape": null, "rate": 0.5, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout_20"}, "inbound_nodes": [[["dense_39", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_20"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "activation": "sigmoid", "name": "dense_40"}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "class_name": "Dense", "name": "dense_40"}], "input_layers": [["input_20", 0, 0]], "name": "model_20", "output_layers": [["dense_40", 0, 0]]}, "backend": "tensorflow"}