{"config": {"output_layers": [["dense_550", 0, 0]], "input_layers": [["input_238", 0, 0]], "name": "model_238", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 600, 64, 1], "name": "input_238", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_238", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_279", "use_bias": true, "data_format": "channels_last", "kernel_size": [2, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_279", "inbound_nodes": [[["input_238", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_280", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_280", "inbound_nodes": [[["input_238", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_281", "use_bias": true, "data_format": "channels_last", "kernel_size": [4, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_281", "inbound_nodes": [[["input_238", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_282", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_282", "inbound_nodes": [[["input_238", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_283", "use_bias": true, "data_format": "channels_last", "kernel_size": [6, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_283", "inbound_nodes": [[["input_238", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_284", "use_bias": true, "data_format": "channels_last", "kernel_size": [7, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_284", "inbound_nodes": [[["input_238", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "name": "conv2d_285", "use_bias": true, "data_format": "channels_last", "kernel_size": [8, 64], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "dtype": "float32"}, "class_name": "Conv2D", "name": "conv2d_285", "inbound_nodes": [[["input_238", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_279", "strides": [3, 1], "pool_size": [3, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_279", "inbound_nodes": [[["conv2d_279", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_280", "strides": [3, 1], "pool_size": [3, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_280", "inbound_nodes": [[["conv2d_280", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_281", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_281", "inbound_nodes": [[["conv2d_281", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_282", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_282", "inbound_nodes": [[["conv2d_282", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_283", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_283", "inbound_nodes": [[["conv2d_283", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_284", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_284", "inbound_nodes": [[["conv2d_284", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "max_pooling2d_285", "strides": [2, 1], "pool_size": [2, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_285", "inbound_nodes": [[["conv2d_285", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "dtype": "float32", "name": "concatenate_183"}, "class_name": "Concatenate", "name": "concatenate_183", "inbound_nodes": [[["max_pooling2d_279", 0, 0, {}], ["max_pooling2d_280", 0, 0, {}], ["max_pooling2d_281", 0, 0, {}], ["max_pooling2d_282", 0, 0, {}], ["max_pooling2d_283", 0, 0, {}], ["max_pooling2d_284", 0, 0, {}], ["max_pooling2d_285", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "flatten_238"}, "class_name": "Flatten", "name": "flatten_238", "inbound_nodes": [[["concatenate_183", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_549", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 128, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "dense_549", "inbound_nodes": [[["flatten_238", 0, 0, {}]]]}, {"config": {"name": "dropout_294", "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_294", "inbound_nodes": [[["dense_549", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "name": "dense_550", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_550", "inbound_nodes": [[["dropout_294", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.5"}