{"class_name": "Model", "keras_version": "2.2.5", "config": {"name": "model_103", "layers": [{"name": "input_94", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_94", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 600, 64, 1]}}, {"name": "conv2d_144", "class_name": "Conv2D", "inbound_nodes": [[["input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [2, 64], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_144", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv2d_145", "class_name": "Conv2D", "inbound_nodes": [[["input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 64], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_145", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv2d_146", "class_name": "Conv2D", "inbound_nodes": [[["input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [4, 64], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_146", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv2d_147", "class_name": "Conv2D", "inbound_nodes": [[["input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [5, 64], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_147", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv2d_148", "class_name": "Conv2D", "inbound_nodes": [[["input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [6, 64], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_148", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv2d_149", "class_name": "Conv2D", "inbound_nodes": [[["input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [7, 64], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_149", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "conv2d_150", "class_name": "Conv2D", "inbound_nodes": [[["input_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [8, 64], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_150", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "padding": "valid", "filters": 32, "bias_constraint": null}}, {"name": "max_pooling2d_144", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_144", 0, 0, {}]]], "config": {"name": "max_pooling2d_144", "pool_size": [3, 1], "dtype": "float32", "trainable": true, "strides": [3, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "max_pooling2d_145", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_145", 0, 0, {}]]], "config": {"name": "max_pooling2d_145", "pool_size": [3, 1], "dtype": "float32", "trainable": true, "strides": [3, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "max_pooling2d_146", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_146", 0, 0, {}]]], "config": {"name": "max_pooling2d_146", "pool_size": [2, 1], "dtype": "float32", "trainable": true, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "max_pooling2d_147", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_147", 0, 0, {}]]], "config": {"name": "max_pooling2d_147", "pool_size": [2, 1], "dtype": "float32", "trainable": true, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "max_pooling2d_148", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_148", 0, 0, {}]]], "config": {"name": "max_pooling2d_148", "pool_size": [2, 1], "dtype": "float32", "trainable": true, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "max_pooling2d_149", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_149", 0, 0, {}]]], "config": {"name": "max_pooling2d_149", "pool_size": [2, 1], "dtype": "float32", "trainable": true, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "max_pooling2d_150", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_150", 0, 0, {}]]], "config": {"name": "max_pooling2d_150", "pool_size": [2, 1], "dtype": "float32", "trainable": true, "strides": [2, 1], "data_format": "channels_last", "padding": "valid"}}, {"name": "concatenate_93", "class_name": "Concatenate", "inbound_nodes": [[["max_pooling2d_144", 0, 0, {}], ["max_pooling2d_145", 0, 0, {}], ["max_pooling2d_146", 0, 0, {}], ["max_pooling2d_147", 0, 0, {}], ["max_pooling2d_148", 0, 0, {}], ["max_pooling2d_149", 0, 0, {}], ["max_pooling2d_150", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_93", "dtype": "float32", "trainable": true}}, {"name": "flatten_94", "class_name": "Flatten", "inbound_nodes": [[["concatenate_93", 0, 0, {}]]], "config": {"name": "flatten_94", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"name": "dense_225", "class_name": "Dense", "inbound_nodes": [[["flatten_94", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_225", "activation": "relu", "dtype": "float32", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"name": "dropout_114", "class_name": "Dropout", "inbound_nodes": [[["dense_225", 0, 0, {}]]], "config": {"seed": null, "name": "dropout_114", "dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"name": "dense_226", "class_name": "Dense", "inbound_nodes": [[["dropout_114", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_226", "activation": "sigmoid", "dtype": "float32", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}], "output_layers": [["dense_226", 0, 0]], "input_layers": [["input_94", 0, 0]]}, "backend": "tensorflow"}