{"config": {"name": "model_4", "layers": [{"name": "input_4", "config": {"name": "input_4", "batch_input_shape": [null, 600, 64, 1], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_9", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [2, 64], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_9", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_10", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 64], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_10", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_11", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 64], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_11", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_12", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 64], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_12", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_13", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [6, 64], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_13", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_14", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [7, 64], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_14", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_15", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [8, 64], "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "valid", "name": "conv2d_15", "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pooling2d_9", "config": {"pool_size": [3, 1], "strides": [3, 1], "trainable": true, "name": "max_pooling2d_9", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_10", "config": {"pool_size": [3, 1], "strides": [3, 1], "trainable": true, "name": "max_pooling2d_10", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_11", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_11", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_12", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_12", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_13", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_13", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_14", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_14", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "max_pooling2d_15", "config": {"pool_size": [2, 1], "strides": [2, 1], "trainable": true, "name": "max_pooling2d_15", "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "dtype": "float32", "axis": 1}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}], ["max_pooling2d_10", 0, 0, {}], ["max_pooling2d_11", 0, 0, {}], ["max_pooling2d_12", 0, 0, {}], ["max_pooling2d_13", 0, 0, {}], ["max_pooling2d_14", 0, 0, {}], ["max_pooling2d_15", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "flatten_4", "config": {"trainable": true, "name": "flatten_4", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_9", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "units": 128, "bias_constraint": null, "trainable": true, "name": "dense_9", "dtype": "float32"}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_6", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_6", "dtype": "float32", "rate": 0.5}, "inbound_nodes": [[["dense_9", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_10", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "units": 1, "bias_constraint": null, "trainable": true, "name": "dense_10", "dtype": "float32"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_10", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model"}